{
  "intents": [
    {
      "tag": "inappropriate_touching",
      "patterns": [
        "My teacher keeps touching my shoulder and it makes me uncomfortable",
        "Someone at school touched me in a way that felt wrong",
        "A student in my class keeps trying to touch me even when I say no",
        "What should I do if someone touches my private parts at school?",
        "Is it normal for a teacher to touch students' legs?",
        "My friend told me someone touched them inappropriately in the bathroom",
        "I don't like how this person at school hugs me",
        "Can teachers touch students at all?",
        "A classmate grabbed me in a way that felt wrong",
        "Someone keeps brushing against me on purpose",
        "My teacher touched me when no one was looking",
        "How do I know if touching is inappropriate?"
      ],
      "responses": [
        "Thank you for sharing this with me. Nobody should touch you in a way that makes you uncomfortable. This isn't your fault, and it's important to tell a trusted adult like a parent, school counselor, or another teacher immediately. Would you like information about who you can talk to?",
        "I'm sorry you're experiencing this. Your body belongs to you, and you have the right to say no to any touch that makes you uncomfortable. It's important to report this to a trusted adult as soon as possible. This situation isn't your fault, and there are people who can help.",
        "What you're describing sounds concerning. You deserve to feel safe at school. Please tell a parent, guardian, school counselor or another trusted adult about this situation right away. They can take steps to make sure you're protected. Remember that this is not your fault."
      ]
    },
    {
      "tag": "private_parts_touching",
      "patterns": [
        "Someone touched my private areas at school",
        "What if someone keeps trying to touch my chest or bottom?",
        "A person at school tried to touch under my clothes",
        "Is it wrong if someone asks to touch or see my private parts?",
        "My teacher touched me in my private area",
        "Another student kept touching my private areas during class",
        "Someone cornered me in the bathroom and touched me",
        "My friend said a teacher touched their private parts",
        "What should I do if someone forces me to touch their private parts?",
        "A classmate keeps trying to put their hand in my pants",
        "Someone older than me keeps touching my genitals",
        "My coach touches students in inappropriate places"
      ],
      "responses": [
        "This is very serious and absolutely not okay. No one should ever touch your private parts at school or anywhere else. This isn't your fault, and you've done the right thing by speaking up. Please tell a trusted adult like a parent, guardian, or school counselor immediately. If you don't feel comfortable talking to someone at school, you can call a helpline like the Childhelp National Child Abuse Hotline at 1-800-4-A-CHILD (1-800-422-4453).",
        "I'm so sorry this happened. What you're describing is inappropriate and against the law. It's important that you tell a trusted adult right away. This could be a parent, guardian, school principal, counselor, or another teacher. Remember that you did nothing wrong, and it's the responsibility of adults to keep you safe.",
        "Thank you for having the courage to share this. Nobody should ever touch your private parts or ask you to touch theirs. This is a serious situation that needs immediate attention from adults who can help. Please tell a parent, guardian, school counselor, or call a helpline like 1-800-4-A-CHILD right away. You deserve to be safe, and this was not your fault."
      ]
    },
    {
      "tag": "unwanted_photos_videos",
      "patterns": [
        "Someone is taking pictures of girls in our class",
        "A student is recording videos of others without permission",
        "I saw someone taking pictures in the locker room",
        "What should I do if someone took photos of me changing?",
        "Someone is taking pictures up girls' skirts at school",
        "A classmate took a photo of me that I didn't want them to take",
        "My teacher keeps taking photos of certain students",
        "Someone is secretly filming in the bathroom at school",
        "A person at school threatened to share embarrassing photos of me",
        "I found out someone's been recording me without my knowledge",
        "My friend says someone is taking inappropriate pictures of students",
        "Is it legal for someone to take pictures of me at school without asking?"
      ],
      "responses": [
        "This is very concerning behavior. Taking pictures or videos of people without their consent, especially in private areas like bathrooms or locker rooms, is both inappropriate and potentially illegal. You should report this to a teacher, principal, or school counselor immediately. They have a responsibility to investigate and put a stop to this behavior.",
        "Thank you for bringing this up. Taking photos or videos of others without permission, especially in private settings or in inappropriate ways, is a serious violation of privacy. Please tell a trusted adult at school right away, such as a teacher, counselor, or principal. If you don't feel comfortable doing that, please tell a parent or guardian who can help you report this.",
        "What you're describing is not okay and potentially against the law. No one should be taking pictures or recording videos of you or others without permission, especially in private areas. This needs to be reported to school administration immediately. If you're worried about coming forward, consider bringing a friend with you or asking a parent/guardian to help you report this."
      ]
    },
    {
      "tag": "social_media_harassment",
      "patterns": [
        "Someone from school is sending me mean messages online",
        "A classmate keeps posting embarrassing things about me",
        "What should I do about cyberbullying from people at my school?",
        "People from class are leaving nasty comments on my posts",
        "A student created a hate page about me",
        "Someone made a fake account pretending to be me",
        "My classmates are excluding me from online groups on purpose",
        "People from school are spreading rumors about me online",
        "A group chat is being used to talk badly about me",
        "Someone is harassing my friends and me on social media",
        "A person keeps sending me threats through social media",
        "What's considered social media harassment?"
      ],
      "responses": [
        "I'm sorry you're experiencing this. Online harassment is never acceptable. First, don't respond to the messages. Take screenshots as evidence, and then block the person. Report this behavior to a trusted adult like a parent, teacher, or school counselor. Many schools have policies against cyberbullying, even if it happens outside school hours. You can also report the harassment directly to the social media platform.",
        "What you're describing sounds like cyberbullying, and it's not okay. Document everything by taking screenshots before blocking the person. Tell a trusted adult about what's happening, as they can help you take appropriate action. Remember that this isn't your fault, and you deserve to feel safe both online and offline.",
        "This kind of online behavior is serious and harmful. Here are steps you can take: 1) Don't respond to the messages, 2) Save evidence by taking screenshots, 3) Block the person, 4) Tell a trusted adult like a parent or school counselor, 5) Report the content to the social media platform. Many schools have anti-bullying policies that include cyberbullying. Remember that you deserve respect both online and offline."
      ]
    },
    {
      "tag": "social_media_blackmail",
      "patterns": [
        "Someone is threatening to share private pictures of me if I don't do what they want",
        "A person says they'll post embarrassing information about me if I don't send them more photos",
        "What should I do if someone is blackmailing me with private messages?",
        "A classmate is threatening to share secrets about me online",
        "Someone is demanding money or they'll post private content of me",
        "I'm being blackmailed with screenshots of private conversations",
        "A person from school says they'll tell lies about me online if I don't do what they say",
        "Someone is threatening to share altered photos of me",
        "What can I do if someone is using my personal information to blackmail me?",
        "A person is threatening to tell my parents private things if I don't send inappropriate pictures",
        "Someone says they'll ruin my reputation online if I tell anyone about what they're doing",
        "I shared something private and now they're using it against me"
      ],
      "responses": [
        "This is a serious situation called sextortion or digital blackmail, and it's against the law. Do not give in to the demands, as this often leads to more blackmail. Don't delete any evidence - take screenshots instead. Tell a trusted adult immediately, like a parent, guardian, or school counselor. They can help you contact the proper authorities if needed. Remember that this isn't your fault, and there are people who can help you through this situation.",
        "I'm very sorry you're going through this. Blackmail is illegal, and you don't have to face this alone. First, don't send any more images or money. Keep records of all communication but don't continue engaging with the person. Tell a trusted adult immediately - they won't judge you and can help stop this situation. In many cases, involving law enforcement early is the best way to prevent further harm.",
        "What you're describing is blackmail, and it's a crime regardless of how the situation started. Don't comply with their demands, as this usually leads to more blackmail. Save all evidence, stop all communication with this person, and tell a trusted adult right away. If you're afraid to tell your parents, consider talking to a school counselor who can help you handle the situation. Remember that many young people face similar situations, and help is available."
      ]
    },
    {
      "tag": "grooming_behavior",
      "patterns": [
        "An adult at school gives me special attention and gifts",
        "My teacher wants to meet outside of school hours",
        "Someone keeps telling me I'm special and different from others",
        "An older person is asking me to keep our relationship secret",
        "What if someone much older says they have romantic feelings for me?",
        "My coach wants to spend time alone with me outside of practice",
        "A teacher sends me private messages that make me uncomfortable",
        "An adult asks me personal questions about my body or dating life",
        "Someone at school compliments my body in ways that feel strange",
        "An older person says they understand me better than people my age",
        "My teacher says I'm mature for my age and treats me differently",
        "Should I be concerned if an adult wants to be my special friend?"
      ],
      "responses": [
        "What you're describing sounds like potential grooming behavior. Grooming happens when an adult builds a relationship with a young person to gain their trust for inappropriate purposes. Warning signs include special attention, gifts, requests for secrecy, and inappropriate conversations. This isn't your fault, but it's important to tell a trusted adult like a parent or school counselor about these interactions right away.",
        "I'm concerned about what you're sharing. Adults who single out students for special attention, give gifts, request to meet alone, or ask for secrecy may be engaging in grooming behavior. Appropriate adult-student relationships have clear boundaries and are transparent. Please talk to a trusted adult about this situation as soon as possible. Your safety is the priority.",
        "The behavior you're describing raises some red flags. Healthy adult-student relationships don't involve secrecy, special treatment, inappropriate personal conversations, or meeting alone outside of normal contexts. Trust your instincts if something feels uncomfortable. I encourage you to talk to a parent, guardian, or school counselor about this situation. They can help assess if boundaries are being crossed and take appropriate action."
      ]
    },
    {
      "tag": "bystander_witness",
      "patterns": [
        "I saw someone touching my friend inappropriately at school",
        "My classmate told me someone is harassing them",
        "I think a teacher is behaving inappropriately with students",
        "What should I do if I witness sexual harassment?",
        "My friend showed me inappropriate messages from someone at school",
        "I saw someone taking pictures up someone's skirt",
        "I know someone is being blackmailed but they're afraid to tell",
        "My friend told me something bad happened but made me promise not to tell",
        "I saw something inappropriate happening in the locker room",
        "Should I report something if the victim doesn't want me to?",
        "How can I help a friend who's being sexually harassed?",
        "I overheard something concerning but I'm not sure if I should tell"
      ],
      "responses": [
        "Thank you for wanting to help. When you witness or learn about inappropriate behavior, it's important to speak up. Tell a trusted adult like a teacher, counselor, or parent about what you saw or heard. You don't need to investigate yourself. By reporting what you know, you could be preventing further harm. Your friend might be scared or embarrassed to come forward, but a caring adult can help address the situation appropriately.",
        "Being a supportive friend means sometimes getting help, even if your friend hasn't asked for it. Please tell a trusted adult like a school counselor, teacher, or your parents about what you've witnessed or learned. You can say something like, 'I need to tell you something important that I'm worried about.' You don't need to have all the details, and you're not betraying your friend by getting them help.",
        "You're doing the right thing by recognizing this situation needs attention. When you witness harassment or inappropriate behavior, it's important to tell a trusted adult right away. This isn't 'tattling' - it's looking out for someone's safety and wellbeing. If you're uncomfortable speaking up alone, consider asking another friend to go with you to talk to a counselor or teacher. Remember that staying silent can allow harmful behavior to continue."
      ]
    },
    {
      "tag": "reporting_process",
      "patterns": [
        "How do I report sexual harassment at school?",
        "Who should I tell if something inappropriate happens?",
        "Will I get in trouble for reporting someone?",
        "What happens after I tell someone about abuse?",
        "I'm afraid to report what happened to me",
        "Can I report something anonymously?",
        "What if no one believes me when I report?",
        "How do I tell my parents about what happened at school?",
        "Will everyone find out if I report inappropriate behavior?",
        "What proof do I need to report something?",
        "I reported before and nothing happened",
        "Who can help me if the school doesn't take my report seriously?"
      ],
      "responses": [
        "You can report inappropriate behavior to any trusted adult at school, such as a teacher, counselor, nurse, or principal. You won't get in trouble for making a report in good faith. When you report, be as clear as possible about what happened, when, and who was involved. The school should keep your report confidential (though they may need to share some information to investigate). If you don't feel comfortable talking to someone at school, tell a parent, guardian, or call a helpline like 1-800-4-A-CHILD.",
        "Reporting can feel scary, but it's brave and important. You can start by telling any trusted adult - at school this could be a counselor, teacher, nurse, or principal. Outside school, you can tell a parent, relative, or call a helpline. You don't need 'proof' to report - just tell what you experienced or witnessed. Schools are required to investigate reports of sexual harassment and abuse. If you feel your report isn't being taken seriously, keep telling adults until someone helps.",
        "I understand reporting can be intimidating. First, identify a trusted adult you feel comfortable talking to - this could be a parent, teacher, counselor, or other school staff. Be honest about what happened, even if it's embarrassing or difficult to talk about. Know that school staff are mandated reporters, which means they're required by law to report suspected abuse to appropriate authorities. Your information should be kept private, though some details may need to be shared to address the situation properly. If one person doesn't help, don't give up - tell someone else."
      ]
    },
    {
      "tag": "defining_consent",
      "patterns": [
        "What does consent mean?",
        "How do I know if something is okay or not okay?",
        "When is touching appropriate vs inappropriate?",
        "Can I say no to a teacher or adult?",
        "What are personal boundaries?",
        "How do I tell someone I don't want to be touched?",
        "Is it okay to hug my friends at school?",
        "What parts of my body are private?",
        "How do I know if someone crossed a boundary?",
        "What's the difference between friendly touching and inappropriate touching?",
        "Am I allowed to say no to physical contact?",
        "What if I'm not sure if something is appropriate?"
      ],
      "responses": [
        "Consent means giving permission for something to happen. For any kind of touch, all people involved should agree, it should be freely given (not pressured), and anyone can change their mind at any time. Your private parts include the areas covered by a bathing suit, but you have the right to say no to any touch that makes you uncomfortable, even if it seems innocent like a hug or high-five. If you're unsure if something is appropriate, listen to your feelings - if it makes you uncomfortable, it's okay to say no and tell a trusted adult.",
        "You always have the right to decide who touches your body and how, even with adults and authority figures. You can politely but firmly say things like 'I don't want a hug' or 'I'd prefer a high-five instead.' Private parts of your body are those covered by underwear, but inappropriate touch can involve any part of your body that makes you uncomfortable. If someone's touch feels wrong, confusing, or makes you uncomfortable, that's an important signal to listen to and tell a trusted adult about.",
        "Appropriate touch is respectful, comfortable, and happens in open spaces with your permission. Inappropriate touch might feel uncomfortable, happen in private, involve private body parts, or come with requests for secrecy. You always have the right to say 'no' to any touch, even from teachers or other adults. You can say things like 'Please stop,' 'I don't like that,' or 'I'm not comfortable with that.' If someone doesn't respect your boundaries or makes you feel uncomfortable, tell a trusted adult right away."
      ]
    },
    {
      "tag": "seeking_help",
      "patterns": [
        "I need help but I'm scared to tell anyone",
        "Who can I talk to about something bad that happened?",
        "I don't know who to trust with my problem",
        "What if my parents get mad if I tell them?",
        "Are there people I can talk to outside of school?",
        "How do I know which adult is safe to tell?",
        "Can I talk to someone without my parents knowing?",
        "I'm too embarrassed to talk about what happened",
        "Is there a number I can call for help?",
        "What if the person who hurt me said they'd hurt me if I told?",
        "I need to talk to someone but don't want to get anyone in trouble",
        "How do I start a conversation about something serious?"
      ],
      "responses": [
        "It takes courage to ask for help. There are many trusted adults who can help you, including school counselors, teachers, coaches, parents, or other family members. If you're not sure who to talk to at school, the counselor's office is a good place to start. Outside of school, you can call the Childhelp National Child Abuse Hotline at 1-800-4-A-CHILD (1-800-422-4453) - it's free, confidential, and available 24/7. Remember that a truly trustworthy adult will listen without judgment and prioritize your safety.",
        "I understand it can be scary to speak up. If you're worried about how someone might react, consider starting with 'I need to tell you something important and I need your help.' Most parents want to protect their children, even if they initially feel shocked or upset. If you don't feel safe telling your parents, school counselors are trained to help in these situations. You can also call or text crisis lines like the Crisis Text Line (text HOME to 741741) where trained counselors can help you figure out next steps.",
        "It's normal to feel scared or embarrassed about asking for help, but please know that what happened is not your fault. If someone has threatened to hurt you if you tell, that shows they know what they're doing is wrong. Telling a trusted adult is the best way to make the situation stop and keep yourself safe. You can start by saying 'I have something serious to talk about' or 'I'm worried about something that happened.' Remember that adults have resources and ways to help that you might not know about."
      ]
    },
    {
      "tag": "feelings_after_abuse",
      "patterns": [
        "I feel like what happened was my fault",
        "I can't stop thinking about what happened",
        "I feel dirty or bad after what happened",
        "Why do I feel scared all the time now?",
        "I don't want to go to school anymore",
        "Sometimes I pretend nothing happened",
        "I've been having nightmares since it happened",
        "Is it normal to feel confused about what happened?",
        "I feel angry all the time since it happened",
        "Will I ever feel normal again?",
        "I don't understand why this happened to me",
        "Part of me misses the person who hurt me"
      ],
      "responses": [
        "What happened was absolutely not your fault, no matter what. It's common to have many different feelings after experiencing something traumatic - including confusion, fear, anger, sadness, or even feeling numb. These reactions are normal responses to difficult experiences. Talking to a counselor or therapist can really help process these feelings. They have special training to help young people heal after difficult experiences. Remember that healing takes time, and with proper support, you can work through these feelings.",
        "Many people have similar feelings after uncomfortable or traumatic experiences. It's important to know that these feelings don't mean you did anything wrong - the person who violated your boundaries is responsible for their actions, not you. Having mixed feelings, even about the person who hurt you, is actually quite common. Working with a counselor can help you understand and process these complex emotions. With time and support, these intense feelings will become more manageable.",
        "Your feelings are a normal reaction to an abnormal situation. Our bodies and minds respond to threatening or confusing experiences in many ways - like feeling scared, angry, sad, or wanting to avoid certain places or people. These are protective responses, not signs of weakness. Please know that many people have gone through similar experiences and have been able to heal with proper support. A school counselor or therapist can help you work through these feelings in a safe space. You won't always feel this way."
      ]
    },
    {
      "tag": "digital_safety",
      "patterns": [
        "How do I stay safe online?",
        "What information should I not share on social media?",
        "Is it okay to chat with people I don't know online?",
        "What should I do if someone asks for pictures of me?",
        "How do I know if a website or app is safe?",
        "What should I do if someone online makes me uncomfortable?",
        "Is it safe to use my real name on social media?",
        "What should I do if someone I met online wants to meet in person?",
        "How do I know if someone online is really who they say they are?",
        "What should I do if someone asks me to keep our conversations secret?",
        "Is it safe to share my location on social media?",
        "What if someone asks personal questions online?"
      ],
      "responses": [
        "Staying safe online means being careful about what you share. Don't post personal information like your full name, address, phone number, or school. Be cautious about sharing photos that show your location or school uniform. Remember that once something is posted online, it can be difficult to completely remove. If someone online makes you uncomfortable, asks for personal information, requests photos, or wants to meet in person, block them and tell a trusted adult right away. Trust your instincts - if something feels wrong, it probably is.",
        "Digital safety is important. Use privacy settings on all your social media accounts and only accept friend requests from people you know in real life. Be wary of people who ask lots of personal questions, want to move conversations to private platforms, or request photos. Never agree to meet someone you only know online without discussing it with your parents first. If someone asks you to keep your conversations secret or says things that make you uncomfortable, that's a red flag. Remember that people online aren't always who they claim to be.",
        "To stay safe online: 1) Think before you post - once it's online, it can be hard to take back, 2) Use strong passwords and don't share them, 3) Be careful about what photos you share - they can reveal more information than you realize, 4) Don't share personal details like your address, school, or phone number, 5) Remember that not everyone online is who they say they are, 6) If someone makes you uncomfortable, block them and tell a trusted adult, 7) Never meet someone from online without parent permission and supervision. If you're unsure about something, ask a trusted adult for guidance."
      ]
    },
    {
      "tag": "assault_disclosure_recent",
      "patterns": [
        "I was raped yesterday and don't know what to do",
        "Someone forced themselves on me last night",
        "I was sexually assaulted this weekend",
        "I didn't want to but they made me have sex with them",
        "I said no but they wouldn't stop",
        "Someone attacked me sexually and I'm scared",
        "I was violated last night and don't know who to tell",
        "I think I was drugged and assaulted at a party",
        "They forced me to do sexual things against my will",
        "I woke up and someone was assaulting me",
        "I was physically forced into sexual acts",
        "I couldn't fight them off when they assaulted me",
        "I froze when they started to assault me",
        "I'm in pain from being sexually assaulted",
        "I think what happened to me last night was rape"
      ],
      "responses": [
        "I'm so sorry this happened to you. What you've experienced is not your fault, and you deserve support. For recent assaults, consider seeking immediate medical care - don't shower, change clothes, or brush teeth if possible, as this preserves evidence. A hospital can provide care and offer a sexual assault forensic exam if you choose. You can call the National Sexual Assault Hotline at 1-800-656-HOPE (4673) to speak with someone who can guide you through your options and provide support. Remember that you get to decide what steps to take next.",
        "I'm deeply sorry about what you've experienced. Your safety and wellbeing come first right now. If the assault was recent, you might consider going to an emergency room or sexual assault treatment center, where they can provide medical care and collect evidence if you decide to report later. Don't feel pressured to make decisions about reporting immediately. The RAINN hotline (1-800-656-HOPE) can connect you with local resources and support. What happened wasn't your fault, and there are people who can help you through this.",
        "What you've described sounds like sexual assault, and I'm truly sorry this happened to you. For a recent assault, consider seeking medical attention even if you're not visibly injured. Medical professionals can provide care, testing for STIs, emergency contraception if needed, and can collect evidence. If you choose to report, you can call the police or go to a hospital. You can also call 1-800-656-HOPE anytime to speak with a trained staff member from a local sexual assault service provider. Please know that what happened was not your fault, and you deserve support."
      ]
    },
    {
      "tag": "assault_disclosure_past",
      "patterns": [
        "I was raped years ago and never told anyone",
        "I was sexually assaulted as a child and still struggle with it",
        "Something happened to me when I was younger that I think was sexual assault",
        "I've been keeping my sexual assault a secret for a long time",
        "I was raped in college but never reported it",
        "I'm having nightmares about being assaulted years ago",
        "I'm just now realizing what happened to me was rape",
        "I was assaulted by a family member when I was young",
        "I've never talked about my assault until now",
        "I was violated as a teenager and it still affects me",
        "I didn't understand it was assault when it happened years ago",
        "The memories of my assault keep coming back",
        "I was taken advantage of when I was too young to understand",
        "I've been carrying the burden of my assault for years",
        "I was too ashamed to tell anyone about my assault before"
      ],
      "responses": [
        "Thank you for sharing something so personal. Many survivors don't disclose their experiences immediately, and there's no timeline for when you should tell someone. What happened wasn't your fault, regardless of when it occurred. Even if the assault happened years ago, support is still available. Speaking with a therapist who specializes in trauma can be particularly helpful for processing past experiences. Organizations like RAINN (1-800-656-HOPE) can connect you with local resources and support groups for survivors. Your healing journey is your own, and it takes courage to acknowledge these experiences.",
        "I want to acknowledge your courage in sharing this. Many survivors don't talk about their experiences for years or even decades, for many different reasons. What happened to you was not your fault, and it's never too late to seek support. A trauma-informed therapist can help you process these experiences and develop coping strategies for symptoms like nightmares or flashbacks. The National Sexual Assault Hotline (1-800-656-HOPE) can help you find local resources. Your past doesn't define you, but getting support can help you process what happened.",
        "Sharing about a past assault takes immense courage, and I want to honor that. There's no statute of limitations on trauma - many people don't process or disclose sexual assault until years later, and that's completely normal. While legal options might be more limited for past assaults depending on your location and the timeframe, emotional support is always available. Consider reaching out to a therapist who specializes in trauma, or contact RAINN at 1-800-656-HOPE to learn about support groups and resources in your area. What happened wasn't your fault, and healing is possible at any point."
      ]
    },
    {
      "tag": "reporting_options",
      "patterns": [
        "How do I report being raped?",
        "What happens if I tell the police about my sexual assault?",
        "Is it worth reporting my rape?",
        "I want to report my assault but I'm scared",
        "Will they believe me if I report my sexual assault?",
        "What evidence do I need to report a rape?",
        "How do I press charges for sexual assault?",
        "What are my options for reporting a sexual assault?",
        "I was assaulted but I'm afraid to go to the police",
        "Can I report anonymously if I was raped?",
        "How long do I have to report a sexual assault?",
        "What's the process of reporting rape like?",
        "Will I have to see my attacker if I report?",
        "I want justice for my assault, how do I start?",
        "What rights do I have when reporting sexual assault?"
      ],
      "responses": [
        "Reporting sexual assault is a personal choice, and there are multiple options. You can report to police by calling 911, going to a station, or having an officer come to you. Many hospitals have trained staff who can help with reporting. Some areas offer anonymous or third-party reporting options. The legal process typically involves giving a statement, investigation, and possibly court proceedings if charges are filed. Statutes of limitations vary by state and type of assault. Consider bringing a trusted person for support when reporting, and know that victim advocates can accompany you through the process. The National Sexual Assault Hotline (1-800-656-HOPE) can explain local reporting options.",
        "Deciding whether to report is entirely your choice. If you choose to report to law enforcement, you can go to a police station, call them to come to you, or report at a hospital during a sexual assault forensic exam. The process typically involves giving a detailed statement and answering questions. You don't need to have evidence to report, though any information helps (texts, emails, clothing, etc.). Many areas have victim advocates who can accompany you and explain the process. The timeframe for reporting varies by state, but earlier reports generally make investigation easier. Remember that reporting doesn't automatically mean a trial will occur - many cases resolve in other ways.",
        "You have several options for reporting sexual assault. The traditional approach is reporting directly to police, which involves giving a statement and participating in an investigation. Some areas offer alternative reporting options, including anonymous reports or information-only reports that don't trigger an immediate investigation. Many survivors find it helpful to have a victim advocate with them during reporting; hospitals and rape crisis centers can connect you with one. There's no perfect amount of evidence needed - you can report even if time has passed or physical evidence isn't available. For information specific to your area's reporting process, RAINN (1-800-656-HOPE) can connect you with local resources."
      ]
    },
    {
      "tag": "medical_concerns",
      "patterns": [
        "Should I go to the hospital after being raped?",
        "What is a rape kit and should I get one?",
        "I'm worried about STDs after sexual assault",
        "Can I get pregnant from being raped?",
        "I'm injured from a sexual assault",
        "What medical care should I seek after assault?",
        "How long after assault can they collect evidence?",
        "I need emergency contraception after assault",
        "What happens during a sexual assault exam?",
        "Will insurance cover my assault-related medical care?",
        "I'm scared to go to the hospital after being assaulted",
        "What tests should I get after sexual assault?",
        "Can I get a rape kit done anonymously?",
        "I was assaulted but don't have visible injuries",
        "I'm worried about HIV after being assaulted"
      ],
      "responses": [
        "Seeking medical care after sexual assault is important, even if you don't have visible injuries. A sexual assault forensic exam (sometimes called a 'rape kit') can collect evidence up to 120 hours (5 days) after assault, though sooner is better for evidence collection. During the exam, a specially trained nurse will document injuries, collect evidence, and offer testing for STIs and pregnancy. They can also provide emergency contraception and preventative medication for certain STIs, including HIV post-exposure prophylaxis if appropriate. You can have an exam without reporting to police in most places, and many states preserve evidence even if you're undecided about reporting. The Violence Against Women Act ensures forensic exams are free in all states.",
        "Medical care after sexual assault serves several important purposes: treating injuries, preventing pregnancy and STIs, and collecting evidence if you choose. A sexual assault nurse examiner (SANE) can perform a specialized exam, documenting injuries and collecting evidence while being sensitive to your trauma. This exam is available even if you don't want to report to police right now. Emergency contraception works best within 72 hours, and certain STI medications work best if started quickly. If you're concerned about costs, hospital patient advocates can help explain coverage options - many states have victim compensation programs that cover assault-related medical expenses.",
        "I recommend considering medical care after assault, even without visible injuries. Healthcare providers can: 1) Treat injuries you might not see, 2) Provide emergency contraception to prevent pregnancy, 3) Offer medication to prevent certain STIs, 4) Collect evidence through a sexual assault forensic exam if it's within 5 days of the assault. You can request a female examiner if that makes you more comfortable. The exam is your choice - you can stop or pause at any time, and you decide which parts you consent to. You can have a support person with you. Most hospitals have protocols to prioritize assault survivors in the ER to reduce waiting times. The National Sexual Assault Hotline (1-800-656-HOPE) can help you find a facility with specially trained staff."
      ]
    },
    {
      "tag": "supporting_friend_family",
      "patterns": [
        "My friend told me they were raped, how can I help?",
        "My child was sexually assaulted, what should I do?",
        "Someone I love was raped and I don't know how to support them",
        "My partner was assaulted and won't get help",
        "How do I talk to someone who's been sexually assaulted?",
        "What should I not say to a rape survivor?",
        "My sibling was assaulted and is struggling",
        "How can I support someone who was raped years ago?",
        "My roommate was assaulted and I want to help",
        "What resources can I share with a sexual assault survivor?",
        "My friend disclosed their assault and I'm not sure what to do",
        "How do I help someone heal from sexual assault?",
        "My family member was raped and is having a hard time coping",
        "How do I create a safe space for someone who was assaulted?",
        "What are the best ways to support a survivor of rape?"
      ],
      "responses": [
        "Supporting a survivor begins with believing them and listening without judgment. Let them lead the conversation and avoid asking for details they're not offering. Say things like 'I believe you,' 'It wasn't your fault,' and 'I'm here for you.' Avoid questions that might sound blaming, like 'Why were you there?' or 'Why didn't you fight back?' Respect their decisions about reporting and seeking help - pressuring them removes control just like the assault did. Offer to help research options or accompany them to appointments if they want. Take care of yourself too, as supporting someone through trauma can be emotionally taxing. RAINN's website (rainn.org) has excellent resources for supporters.",
        "When supporting someone who's been sexually assaulted, remember that trauma affects everyone differently. The most important things you can do are believe them unconditionally, listen actively, and validate their feelings without telling them how they 'should' feel or what they 'should' do. Offer practical help based on what they want - whether that's researching therapists, accompanying them to appointments, or just providing distraction when needed. Learn about trauma responses so you understand behaviors like withdrawal or emotional numbness. For specific guidance tailored to your situation, consider calling the National Sexual Assault Hotline (1-800-656-HOPE) - they advise supporters too, not just survivors.",
        "Supporting a survivor means empowering them to regain control. Start by believing them completely and listening without interruption. Statements like 'I'm so sorry this happened,' 'You did nothing to deserve this,' and 'I believe you' are powerful. Let them make their own decisions about reporting, medical care, and who to tell - offer information without pressure. Be patient with their healing process, which isn't linear and has no timetable. Educate yourself about sexual trauma through resources like RAINN.org rather than asking the survivor to explain everything. If you're supporting a child who was assaulted, consult with a professional who specializes in childhood trauma for age-appropriate guidance."
      ]
    },
    {
      "tag": "trauma_symptoms",
      "patterns": [
        "I can't stop thinking about my assault",
        "I'm having flashbacks about being raped",
        "I feel numb since my sexual assault",
        "I'm having nightmares about my rape",
        "I get triggered by things that remind me of my assault",
        "I feel like I'm going crazy after being raped",
        "I can't sleep since my sexual assault",
        "Why am I angry all the time since my assault?",
        "I feel disconnected from my body after being raped",
        "I get panic attacks when I think about my assault",
        "I'm scared all the time since being sexually assaulted",
        "I can't concentrate since my trauma",
        "I don't enjoy anything since my sexual assault",
        "I keep reliving my rape in my mind",
        "Why do I feel shame after being assaulted?"
      ],
      "responses": [
        "What you're describing are common trauma responses to sexual assault. Many survivors experience flashbacks, nightmares, anxiety, emotional numbness, or feeling constantly on alert. These reactions are your brain's natural response to trauma, not signs of weakness or 'going crazy.' Trauma-focused therapy approaches like EMDR or CPT can help process these experiences. In the meantime, grounding techniques can help with flashbacks - try naming 5 things you can see, 4 you can touch, 3 you can hear, 2 you can smell, and 1 you can taste. The RAINN hotline (1-800-656-HOPE) can connect you with local therapy resources. Remember that healing isn't linear, but these symptoms can improve with proper support.",
        "The symptoms you're describing are part of the body's normal response to trauma. Sexual assault can trigger the brain's alarm system, leading to hypervigilance, intrusive memories, sleep disturbances, and emotional changes. These reactions don't mean you're weak or handling things poorly - they're how our brains process significant trauma. A trauma-informed therapist can provide tools for managing these symptoms and work with you to process the experience. Some survivors find relief through mindfulness practices, physical activity, creative expression, or support groups. The path to healing looks different for everyone, but these reactions typically become less intense over time with proper support.",
        "These reactions are typical after sexual trauma and are collectively known as trauma responses. Many survivors experience some combination of intrusive thoughts, nightmares, emotional numbness, irritability, difficulty concentrating, and feeling on edge. These symptoms occur because traumatic experiences are processed differently in the brain than ordinary memories. Working with a therapist who specializes in trauma can help - effective approaches include Cognitive Processing Therapy, EMDR, and Prolonged Exposure therapy. While waiting to connect with therapy, self-care strategies like regular routines, gentle physical activity, journaling, and relaxation techniques can help manage symptoms. The National Sexual Assault Hotline (1-800-656-HOPE) can connect you with specialists in your area."
      ]
    },
    {
      "tag": "legal_process",
      "patterns": [
        "What happens in court for sexual assault cases?",
        "Do I need a lawyer if I was raped?",
        "What are my rights as a sexual assault victim in court?",
        "How long does a rape case take?",
        "What evidence is needed to convict a rapist?",
        "Will I have to see my attacker in court?",
        "What's the difference between criminal and civil cases for assault?",
        "Can I get a restraining order against my rapist?",
        "What happens during a sexual assault trial?",
        "How do I prepare for testifying about my assault?",
        "What if the person who assaulted me isn't convicted?",
        "Do I have to pay for a lawyer in a rape case?",
        "What is a victim impact statement?",
        "Will my name be public if I take my rape case to court?",
        "What compensation can I get after a sexual assault?"
      ],
      "responses": [
        "The legal process for sexual assault cases can be complex. In a criminal case, the prosecutor (not you) brings charges against the accused, while you serve as a witness. You don't need your own lawyer for criminal proceedings, though some survivors hire attorneys to protect their rights. The process typically includes investigation, possible grand jury, arraignment, pre-trial hearings, possible plea bargaining, trial if necessary, and sentencing if convicted. Many states have laws to protect survivors during testimony, such as shields from direct view of the defendant or limitations on sexual history evidence. Victim advocates can support you throughout this process and explain local procedures. Separately, you might consider a civil lawsuit seeking financial damages, which would require your own attorney.",
        "Sexual assault cases proceed differently depending on your jurisdiction, but generally follow these steps: After reporting, detectives investigate and, if sufficient evidence exists, prosecutors decide whether to file charges. If charges are filed, the case proceeds through arraignment, pre-trial motions, and possibly to trial. As the survivor, you would likely be asked to testify, though many courthouses offer protective measures like separate waiting areas and support person accompaniment. Most jurisdictions have victim-witness coordinators who can explain the process, your rights, and available protections. Criminal cases determine guilt and possible incarceration, while separate civil cases can provide financial compensation. Protective orders (restraining orders) are available regardless of criminal case outcomes.",
        "In the legal system, sexual assault cases can follow two paths: criminal proceedings (focused on punishing the perpetrator) and civil litigation (focused on compensation). In criminal cases, the prosecutor represents the state, not you personally. The process includes investigation, possible grand jury review, arraignment, pre-trial hearings, and potentially trial. Victims' rights vary by state but typically include: the right to be notified of proceedings, protection from intimidation, the right to be heard at sentencing, and privacy protections for personal information. A victim advocate can explain your specific rights and support you through the process. Many survivors find it helpful to understand that the burden of proof in criminal cases ('beyond reasonable doubt') is higher than in civil cases ('preponderance of evidence'), which affects case outcomes."
      ]
    },
    {
      "tag": "assault_by_known_person",
      "patterns": [
        "I was raped by someone I know and trust",
        "My friend sexually assaulted me",
        "I was raped by a family member",
        "My partner forced me to have sex",
        "I was assaulted by someone I'm dating",
        "My boss sexually assaulted me",
        "I was raped by someone I live with",
        "My ex assaulted me after we broke up",
        "I was violated by a teacher/coach/mentor",
        "Someone I thought was a friend assaulted me",
        "I was raped by my spouse/significant other",
        "I was sexually assaulted by a coworker",
        "My roommate violated me",
        "Someone I trusted took advantage of me sexually",
        "I was assaulted by a relative and no one believes me"
      ],
      "responses": [
        "Being assaulted by someone you know can add layers of complexity to your experience. It's common to feel confused, betrayed, or to question your judgment, but remember that the person who violated your trust is solely responsible. Many sexual assaults are committed by acquaintances, friends, or family members - this doesn't make what happened any less real or serious. Your safety is the priority, especially if you have ongoing contact with this person. Consider your options for creating distance, including protective orders if necessary. Some survivors find it helpful to work with a therapist who specializes in both trauma and relationship issues. The National Sexual Assault Hotline (1-800-656-HOPE) can help you navigate these complicated situations.",
        "Sexual assault by someone you know is actually the most common form of sexual violence, though it's less discussed than stranger assault. Your feelings of confusion, betrayal, or self-doubt are normal reactions. What happened is not your fault - trusting someone doesn't give them permission to violate your boundaries. If you live with or regularly see this person, consider making a safety plan, which might include staying elsewhere temporarily, having someone with you when the person is present, or seeking a protective order. Some communities have housing and financial assistance for survivors who need to relocate. A counselor can help you work through the complex emotions of betrayal trauma and decide how to handle any ongoing relationship with the person or shared social connections.",
        "When sexual assault happens within existing relationships, it often causes unique challenges - divided loyalties among friends or family, pressure to reconcile or 'move past it,' and complicated feelings toward the person who harmed you. These complications don't make the assault any less valid. You deserve support that acknowledges these complexities. Practical considerations might include safety planning if you'll have continued contact with this person, addressing shared social connections, and possibly seeking a protection order. Some survivors find it useful to work with legal advocates who understand both sexual assault and relevant laws (like workplace protections for boss/employee situations, or family law for cases involving relatives). Your healing path might look different from other survivors', and that's okay."
      ]
    },
    {
      "tag": "healing_recovery",
      "patterns": [
        "How do I heal after being raped?",
        "Will I ever feel normal again after sexual assault?",
        "What therapy helps after being sexually assaulted?",
        "How do I move on from being raped?",
        "I want my life back after assault",
        "How long does it take to recover from rape?",
        "What self-care helps after sexual assault?",
        "How do I trust people again after being assaulted?",
        "Can you recommend books for sexual assault survivors?",
        "How do I rebuild intimacy after being raped?",
        "I'm trying to heal from my assault but struggling",
        "What are good coping skills for rape survivors?",
        "How can I feel safe again after sexual assault?",
        "I want to reclaim my sexuality after rape",
        "Are there support groups for sexual assault survivors?"
      ],
      "responses": [
        "Healing from sexual assault is a personal journey that unfolds differently for everyone. Many survivors find trauma-focused therapy helpful, particularly approaches designed for trauma like EMDR, CPT, or Somatic Experiencing. Connecting with other survivors through support groups can reduce isolation. Self-care is crucial - prioritize basic needs like sleep, nutrition, and gentle movement. Set boundaries that help you feel safe, and be patient with yourself through difficult emotions. Many survivors report that while they never forget what happened, the assault eventually takes up less space in their lives, and they can experience joy, trust, and intimacy again. Remember that healing isn't linear - having setbacks doesn't mean you're failing. The RAINN hotline (1-800-656-HOPE) can connect you with local resources tailored to your needs.",
        "Recovery after sexual assault takes time and support. Research shows that trauma-informed therapy significantly helps many survivors - approaches like Cognitive Processing Therapy and EMDR have strong evidence behind them. Beyond professional help, many survivors find healing through establishing safety in their environment, reconnecting with their bodies through gentle activities like yoga or walking, creative expression, mindfulness practices, and meaningful connections with supportive people. There's no timeline for healing - some aspects might improve within months, while others take longer. Many survivors describe recovery not as returning to who they were before, but as integrating their experience into a new sense of self that includes greater awareness, resilience, and compassion. Be gentle with yourself through this process.",
        "Healing from sexual assault involves reclaiming your sense of safety, power, and connection. This often happens in stages: establishing physical and emotional safety, processing the trauma, reconnecting with yourself and others, and finding meaning. Many survivors benefit from professional support through this journey. Trauma-focused therapies like CPT, EMDR, and Prolonged Exposure have strong research supporting their effectiveness. Beyond therapy, healing practices might include boundary-setting, body-centered approaches (yoga, dance, martial arts), expressive arts, meditation, and connecting with supportive community. Support groups, both in-person and online, help many survivors feel understood and less alone. Books like 'The Body Keeps the Score' by Bessel van der Kolk and 'Healing from Trauma' by Jasmin Lee Cori offer insights that many survivors find helpful."
      ]
    },
    {
      "tag": "alcohol_drugs_assault",
      "patterns": [
        "I was drunk when I was raped",
        "I was drugged and sexually assaulted",
        "I don't remember parts of my assault because I was intoxicated",
        "Can it be rape if we were both drinking?",
        "I was too high to consent but I'm blamed for the assault",
        "I think someone put something in my drink before assaulting me",
        "I blame myself for drinking before I was assaulted",
        "Is it still rape if I was intoxicated?",
        "I was using drugs when I was assaulted and I'm afraid to report",
        "I got blackout drunk and woke up to someone assaulting me",
        "People say it was my fault for getting drunk when I was raped",
        "I willingly took drugs but didn't consent to sexual activity",
        "How do I prove I was too intoxicated to consent?",
        "I can only remember parts of being assaulted after drinking",
        "I'm embarrassed to report because I was intoxicated when assaulted"
      ],
      "responses": [
        "Being intoxicated does not give anyone permission to assault you. Legally, if you were substantially impaired by alcohol or drugs (whether taken voluntarily or not), you cannot give consent. Someone who takes advantage of your intoxicated state is committing assault. Many survivors have partial or complete memory gaps, which is normal with both alcohol/drugs and trauma. If you suspect you were drugged, try to get tested within 72 hours, though many date rape drugs leave the system quickly. Some jurisdictions have 'amnesty' policies to protect victims who were using substances from prosecution when reporting assault. Remember that regardless of substance use, the responsibility lies solely with the person who chose to assault someone incapable of consenting.",
        "I want to be very clear: being intoxicated never makes sexual assault your fault. Someone who is significantly impaired by alcohol or drugs cannot legally consent to sexual activity, regardless of whether they consumed these substances voluntarily. Many people feel shame or blame themselves for drinking or using drugs, but the only person responsible for sexual assault is the perpetrator who chose to take advantage of someone's impaired state. If you're concerned about reporting due to substance use, know that many law enforcement agencies prioritize investigating the assault over any substance violations. A victim advocate can help you understand how your local authorities typically handle these situations and support you through the reporting process if you choose to report.",
        "Sexual activity with someone who is too intoxicated to give informed consent is assault, regardless of how they became intoxicated. The law in most places recognizes that substantial impairment prevents meaningful consent. It's common to have fragmented memories or complete blackouts from both the substances and trauma itself. This doesn't make your experience any less valid, though it can add challenges to investigation if you choose to report. Medical evidence like toxicology tests (if done quickly enough) and witness statements can help substantiate that you were impaired. Many survivors struggle with self-blame after alcohol/drug-involved assaults due to cultural victim-blaming, but remember: choosing to drink or use drugs is legal; choosing to sexually assault someone who is impaired is a crime."
      ]
    },
    {
      "tag": "reporting_inappropriate_touching",
      "patterns": [
        "Someone touched my private parts without consent",
        "A person touched me inappropriately",
        "I was sexually harassed by someone touching me",
        "My colleague touched my private areas",
        "My teacher touched me inappropriately",
        "A relative touched my private parts",
        "Someone at work keeps touching me inappropriately",
        "I'm a victim of inappropriate touching",
        "A stranger touched my private areas without permission",
        "My boss touched me in a way that made me uncomfortable",
        "I think I was sexually assaulted through inappropriate touching",
        "Someone touched my body parts without my consent",
        "I experienced unwanted touching of my private areas",
        "Someone touched me in a sexual way without permission",
        "A family member touched my private parts",
        "I'm being sexually harassed through touching",
        "I was groped by someone",
        "Someone keeps touching my private areas",
        "I didn't give consent but they touched my private parts anyway",
        "I'm uncomfortable because someone touched me inappropriately"
      ],
      "responses": [
        "I'm very sorry this happened to you. What you've experienced is a form of sexual harassment which is illegal under Section 354A of the Indian Penal Code. Your experience is valid, and it's not your fault. I recommend documenting the incident(s), reporting it to the police, and considering speaking with a trusted person or counselor. You can file a complaint at your local police station or call the Women Helpline at 1091. Under Article 21 of the Indian Constitution, you have the right to dignity and personal liberty.",
        "Thank you for sharing this difficult experience. Inappropriate touching is a serious offense under Indian law, specifically covered by IPC Section 354 (assault or criminal force with intent to outrage modesty). Please consider filing a police complaint at your nearest station or dialing the Women Helpline (1091). Remember that the Protection of Children from Sexual Offences (POCSO) Act provides additional protection if the victim is a minor. Your safety and well-being are important, and there are resources available to help you.",
        "I understand how difficult sharing this must be. Inappropriate touching is a punishable offense under Section 354 of the IPC, with penalties including imprisonment up to 5 years. You have legal protections under Article 21 of the Constitution guaranteeing personal dignity. Please consider reporting this to authorities by visiting your local police station or calling the Women Helpline (1091). If you're comfortable, speak with a trusted family member, friend, or counselor for additional support. Remember, this was not your fault, and you deserve to feel safe."
      ]
    },
    {
      "tag": "witnessed_inappropriate_touching",
      "patterns": [
        "I saw someone touching another person inappropriately",
        "My friend told me they were touched inappropriately",
        "I witnessed inappropriate touching of a colleague",
        "My child says someone touched their private parts",
        "A student reported inappropriate touching by a staff member",
        "I think my friend is being sexually harassed through touching",
        "Someone I know was groped and told me about it",
        "My sibling says they were touched inappropriately",
        "A colleague confided in me about being touched inappropriately",
        "I overheard someone talking about being touched without consent",
        "My friend was a victim of inappropriate touching",
        "I know someone who experienced unwanted touching",
        "A child I know reported being touched inappropriately",
        "My friend complained about being touched in private areas",
        "Someone I care about was touched without consent",
        "A minor told me about inappropriate touching",
        "My employee reported being touched inappropriately",
        "Someone shared their experience of being groped",
        "A family member told me they were touched inappropriately",
        "I'm concerned about someone who was touched without consent"
      ],
      "responses": [
        "Thank you for being concerned about this serious matter. If the victim is a minor, this falls under the POCSO Act 2012, and reporting is mandatory. You can help by encouraging the person to file a police complaint (IPC Section 354 covers assault to outrage modesty) and being supportive. In case of a minor, please report to the nearest police station or call Childline at 1098 immediately. The National Commission for Women also provides assistance at their helpline 7827170170. Under Section 19 of the POCSO Act, reporting such incidents involving minors is legally required.",
        "I appreciate you looking out for others. Witnessing or hearing about such incidents can be distressing. Under Indian law, sexual harassment through touching is punishable under IPC Section 354A. If the victim is an adult, encourage them to file a complaint. If the victim is a minor, reporting is mandatory under the POCSO Act Section 19, and failure to report is punishable. You can help by listening supportively, offering to accompany them to authorities, and respecting their decisions about how to proceed.",
        "Your concern is commendable. In India, inappropriate touching constitutes sexual harassment under IPC Section 354 and 354A. For cases involving minors, the POCSO Act provides strict legal provisions. You should encourage the victim to document details and report to authorities. For workplace incidents, the Sexual Harassment of Women at Workplace (Prevention, Prohibition and Redressal) Act, 2013 requires organizations to have Internal Complaints Committees. Remember that supporting the victim without judgment is crucial during this difficult time."
      ]
    },
    {
      "tag": "what_to_do_after_inappropriate_touching",
      "patterns": [
        "What should I do if someone touched me inappropriately?",
        "How do I report inappropriate touching?",
        "Who should I talk to about being touched without consent?",
        "What are the steps to take after being touched inappropriately?",
        "How can I file a complaint for inappropriate touching?",
        "What actions should I take after experiencing unwanted touching?",
        "I was touched inappropriately, what now?",
        "How do I seek help after being inappropriately touched?",
        "What's the process for reporting someone who touched my private areas?",
        "Who can help me after I've been touched inappropriately?",
        "How should I respond to inappropriate touching?",
        "What should I do after sexual harassment through touching?",
        "How to deal with someone who touched me without consent?",
        "What are my options after experiencing inappropriate touching?",
        "How do I protect myself after being touched inappropriately?",
        "I want to report inappropriate touching but don't know how",
        "What's the right way to handle being touched inappropriately?",
        "How do I get justice after being touched inappropriately?",
        "What should be my first step after inappropriate touching?",
        "How should I proceed after someone touched my private parts?"
      ],
      "responses": [
        "After experiencing inappropriate touching, consider these steps: 1) Find a safe place and contact someone you trust. 2) Document everything (date, time, location, details of the incident, witnesses). 3) Report to the police as this falls under IPC Section 354 (outraging modesty) or 354A (sexual harassment). 4) If it occurred at work, report to your organization's Internal Complaints Committee as mandated by the Sexual Harassment of Women at Workplace Act, 2013. 5) Consider seeking medical attention if needed. 6) Connect with counseling services for emotional support. You can call Women Helpline (1091) or NCW Helpline (7827170170) for guidance.",
        "I'm sorry this happened to you. Here are the important steps to take: First, ensure your safety and, if possible, document the details of the incident. You can file an FIR at any police station under IPC Section 354 (assault or criminal force to woman with intent to outrage her modesty) which is punishable with imprisonment up to 5 years. If the victim is a minor, POCSO Act applies with more severe penalties. You may also approach the National Commission for Women or State Women's Commission for support. Remember, under Article 21 of the Constitution, your dignity and personal liberty are fundamental rights.",
        "After such an experience, prioritize your well-being. Consider these actions: 1) Reach out to someone you trust for immediate support. 2) Preserve evidence by writing down details and not washing clothes if relevant. 3) File a police complaint - inappropriate touching is covered under IPC Section 354 and 354A. 4) For workplace incidents, report to your organization's ICC as required by law. 5) Seek medical attention if needed. 6) Consider professional counseling to process the trauma. The law is on your side - Article 21 of the Constitution protects your dignity, and multiple sections of IPC provide legal recourse against such violations."
      ]
    },
    {
      "tag": "legal_consequences_for_perpetrators",
      "patterns": [
        "What happens to someone who touches others inappropriately?",
        "What are the legal consequences for inappropriate touching?",
        "Can someone go to jail for touching me inappropriately?",
        "What punishment is there for inappropriate touching in India?",
        "How does the law handle cases of inappropriate touching?",
        "What does Indian law say about inappropriate touching?",
        "Are there strict penalties for touching someone inappropriately?",
        "What sections of IPC cover inappropriate touching?",
        "How serious is the crime of inappropriate touching?",
        "Will someone be punished for touching private parts without consent?",
        "What legal action can be taken against someone who touched me inappropriately?",
        "What is the penalty for sexual harassment through touching?",
        "How are perpetrators of inappropriate touching punished?",
        "What happens if someone is found guilty of inappropriate touching?",
        "Are there different penalties for different types of inappropriate touching?",
        "What's the maximum sentence for inappropriate touching?",
        "How does Indian law punish people who touch others inappropriately?",
        "Can someone be arrested for touching private parts without consent?",
        "What legal sections apply to cases of inappropriate touching?",
        "How severely does the law treat inappropriate touching cases?"
      ],
      "responses": [
        "In India, inappropriate touching is a serious offense with significant legal consequences. Under Section 354 of the IPC (assault or criminal force to woman with intent to outrage her modesty), offenders can face imprisonment up to 5 years with fine. Section 354A specifically addresses sexual harassment including physical contact and advances involving unwanted physical contact, punishable with up to 3 years imprisonment. If the victim is a minor, the POCSO Act imposes even stricter penalties, including imprisonment of 3-5 years under Section 7 for sexual assault. These offenses are cognizable and non-bailable, meaning police can arrest without warrant and bail is at the court's discretion.",
        "Inappropriate touching carries serious legal consequences in India. The primary applicable law is IPC Section 354 (outraging modesty) which carries imprisonment of 1-5 years with fine. If it involves sexual harassment through physical contact, Section 354A applies with imprisonment up to 3 years or fine or both. In cases involving minors, the POCSO Act Section 7 (sexual assault) prescribes minimum 3 years imprisonment, extendable to 5 years with fine. Additionally, workplace incidents fall under the Sexual Harassment of Women at Workplace Act, 2013. These are all non-bailable offenses, meaning the accused cannot claim bail as a matter of right.",
        "Under Indian law, inappropriate touching is punishable with significant penalties. The specific charges depend on the circumstances but commonly include IPC Section 354 (assault or criminal force with intent to outrage modesty) carrying up to 5 years imprisonment and fine. For sexual harassment involving physical contact, Section 354A prescribes up to 3 years imprisonment and/or fine. For minors, POCSO Act Section 7 imposes minimum 3 years imprisonment (extendable to 5 years) with fine. These offenses are cognizable (police can arrest without warrant) and non-bailable. The courts take these matters seriously, recognizing them as violations of fundamental rights protected under Article 21 of the Constitution."
      ]
    },
    {
      "tag": "understanding_consent",
      "patterns": [
        "What counts as inappropriate touching?",
        "How do I know if touching is inappropriate?",
        "What is considered as touching without consent?",
        "Can you explain what inappropriate touching means?",
        "What's the definition of inappropriate touching?",
        "How can I tell if someone's touch is inappropriate?",
        "What makes touching inappropriate?",
        "Is touching private parts always inappropriate?",
        "What parts of the body should not be touched without consent?",
        "How do I understand consent for touching?",
        "What touching requires explicit consent?",
        "When does touching become inappropriate?",
        "I'm confused about what counts as inappropriate touching",
        "Can you help me understand inappropriate touching?",
        "What's the line between normal and inappropriate touching?",
        "How can I explain inappropriate touching to others?",
        "What's considered inappropriate touching under law?",
        "Are there different degrees of inappropriate touching?",
        "What should I know about consent and touching?",
        "How is inappropriate touching defined legally?"
      ],
      "responses": [
        "Inappropriate touching generally refers to any unwanted physical contact, especially with private parts of the body or with sexual intent. Under Indian law (IPC Section 354A), it includes physical contact involving unwelcome and explicit sexual overtures. Consent is fundamental - touching without clear permission, especially of private areas (genitals, buttocks, breasts, inner thighs) is inappropriate. Even non-private areas can be inappropriate to touch without consent. The key factors are: was permission given? Was the touch unwelcome? Did it make the person uncomfortable? Did it violate their bodily autonomy? Remember that consent should be enthusiastic, ongoing, and can be withdrawn at any time.",
        "Inappropriate touching refers to unwanted physical contact that violates a person's bodily autonomy, particularly touching of private parts (genitals, buttocks, breasts) without consent. Under Indian law, specifically IPC Section 354 and 354A, any physical contact with sexual intent without consent is considered sexual harassment. Consent must be explicit, informed, and freely given - not assumed, not coerced, and not given under influence of substances or fear. A person has the right to withdraw consent at any time. Cultural context doesn't justify inappropriate touching - everyone has the right to bodily autonomy protected under Article 21 of the Constitution regardless of relationship or setting.",
        "Inappropriate touching involves unwanted physical contact, particularly of intimate areas, without consent. Indian law recognizes this under IPC Section 354A as sexual harassment when there is physical contact and advances involving unwelcome and explicit sexual overtures. Key aspects to understand: 1) Consent must be clearly given, not assumed. 2) Private body parts (genitals, buttocks, breasts) should never be touched without explicit permission. 3) Even touching non-private areas can be inappropriate if unwanted. 4) Power dynamics (boss-employee, teacher-student) can make consent complicated. 5) A person in authority requesting sexual favors constitutes harassment under law. The foundation of appropriate touching is mutual respect and clear communication about boundaries."
      ]
    },
    {
      "tag": "helping_others",
      "patterns": [
        "How can I help someone who was touched inappropriately?",
        "What should I do if my friend was touched without consent?",
        "How to support someone who experienced inappropriate touching?",
        "My child was touched inappropriately, what should I do?",
        "Ways to help victims of inappropriate touching",
        "How to be there for someone who was touched inappropriately",
        "What's the best way to support victims of inappropriate touching?",
        "How should I respond when someone tells me they were touched inappropriately?",
        "What can I do for my friend who experienced unwanted touching?",
        "How to help family members who were touched inappropriately?",
        "What resources can I share with someone who was touched inappropriately?",
        "How should I react when someone discloses inappropriate touching?",
        "Best practices for supporting victims of inappropriate touching",
        "How to be an ally to someone who was touched without consent",
        "What not to say to someone who experienced inappropriate touching",
        "How to create a safe space for someone who was touched inappropriately",
        "What steps can I take to help someone after inappropriate touching?",
        "How can I provide emotional support to victims of inappropriate touching?",
        "What do victims of inappropriate touching need from supporters?",
        "How to help someone report inappropriate touching?"
      ],
      "responses": [
        "To support someone who experienced inappropriate touching: 1) Listen without judgment and believe them - many victims fear not being taken seriously. 2) Acknowledge their feelings and validate their experience. 3) Respect their decisions about reporting - filing a police complaint under IPC Section 354/354A is their choice unless it involves a minor (where reporting is mandatory under POCSO Act). 4) Help them document details if they wish to report. 5) Offer to accompany them to police or medical facilities. 6) Share resources like Women Helpline (1091) or NCW Helpline (7827170170). 7) Respect their privacy and don't share their story without permission. 8) Encourage professional counseling to help process trauma.",
        "Supporting someone after inappropriate touching requires sensitivity. Begin by believing them and listening attentively. Avoid questions that might sound like blame ('what were you wearing?' or 'why were you there?'). Acknowledge that under Article 21 of the Constitution and IPC Sections 354/354A, their bodily autonomy was violated. Offer practical support - accompanying them to file a police complaint, connecting them with counseling services, or helping them report to institutional authorities (like ICC at workplace under Sexual Harassment Act). For child victims, remember that reporting is mandatory under POCSO Act Section 19. Most importantly, follow their lead on what kind of support they need and respect their decisions.",
        "When supporting someone who experienced inappropriate touching: 1) Create a safe space for them to share without pressure. 2) Believe them unconditionally - false reports are extremely rare. 3) Emphasize it wasn't their fault - responsibility lies solely with the perpetrator. 4) Inform them about legal protections under IPC Section 354/354A and their constitutional right to dignity (Article 21). 5) Offer to help them document details and connect with authorities if they choose to report. 6) For workplace incidents, inform them about ICC procedures under the Sexual Harassment Act. 7) Respect their choices about reporting, unless mandatory (as with minors under POCSO). 8) Check in regularly but don't force them to discuss it. 9) Take care of your own emotional health while supporting them."
      ]
    },
    {
      "tag": "prevention_education",
      "patterns": [
        "How can we prevent inappropriate touching?",
        "What should children be taught about inappropriate touching?",
        "How to educate about good touch and bad touch?",
        "What are strategies to prevent inappropriate touching?",
        "How can organizations prevent inappropriate touching?",
        "What policies help prevent inappropriate touching?",
        "How to create awareness about inappropriate touching?",
        "What should schools teach about inappropriate touching?",
        "How to talk to children about private parts and consent?",
        "What are good resources for teaching about inappropriate touching?",
        "How to implement prevention programs for inappropriate touching?",
        "What training can prevent inappropriate touching at workplace?",
        "How to teach consent to prevent inappropriate touching?",
        "What should parents tell children about inappropriate touching?",
        "How can communities prevent inappropriate touching?",
        "What are effective ways to reduce incidents of inappropriate touching?",
        "How to create a culture that prevents inappropriate touching?",
        "What should everyone know to prevent inappropriate touching?",
        "How to teach body autonomy to prevent inappropriate touching?",
        "What preventive measures work against inappropriate touching?"
      ],
      "responses": [
        "Prevention of inappropriate touching requires education and system-level approaches. For children, age-appropriate education about 'good touch, bad touch' is essential - teaching that private parts (covered by underwear) shouldn't be touched by others except for health/hygiene by trusted caregivers. For broader prevention: 1) Educational institutions should implement awareness programs as mandated under POCSO Act Section 43. 2) Workplaces must constitute Internal Complaints Committees under the Sexual Harassment Act, 2013. 3) Communities should promote open conversations about consent. 4) Parents should teach children that their body belongs to them and they can say 'no' to unwanted touch. 5) Organizations should have clear codes of conduct and reporting mechanisms. These measures collectively help create safer environments.",
        "Preventing inappropriate touching requires comprehensive approaches. For children, teach body autonomy early - they have the right to refuse unwanted touch from anyone. Use correct anatomical terms for body parts and explain the 'swimsuit rule' (parts covered by swimwear are private). For organizations, strict implementation of the Sexual Harassment of Women at Workplace Act is crucial - with mandatory ICCs, clear reporting procedures, and regular training. Educational institutions must follow POCSO Act guidelines including background checks for staff. On a societal level, we need ongoing education about consent - that it must be enthusiastic, specific, and can be withdrawn. Creating environments where speaking up is encouraged and reports are taken seriously is fundamental to prevention.",
        "Effective prevention of inappropriate touching involves multiple strategies: 1) Early education - teach children about body boundaries, using correct anatomical terms for body parts, and that it's okay to say 'no' to unwanted touch. 2) Institutional safeguards - schools and organizations should implement proper vetting procedures for staff, clear codes of conduct, and appropriate supervision. 3) Legal awareness - educate communities about protections under IPC Sections 354/354A and POCSO Act. 4) Bystander intervention training - teach people how to safely intervene when they witness concerning behavior. 5) Creating reporting mechanisms that are accessible and responsive. 6) Challenging harmful cultural norms that minimize the importance of consent. Prevention is most effective when it combines education, policy implementation, and cultural change to create environments where respect for bodily autonomy is the norm."
      ]
    },
    {
      "tag": "institutional_responsibilities",
      "patterns": [
        "What should schools do about inappropriate touching?",
        "What are workplace responsibilities regarding inappropriate touching?",
        "How should organizations handle reports of inappropriate touching?",
        "What policies should be in place for inappropriate touching?",
        "What are an employer's legal obligations regarding inappropriate touching?",
        "How should institutions respond to inappropriate touching claims?",
        "What should universities do to prevent inappropriate touching?",
        "What are a school's responsibilities if a child reports inappropriate touching?",
        "How should HR handle inappropriate touching complaints?",
        "What processes should be in place for handling inappropriate touching?",
        "What's the protocol for inappropriate touching in institutions?",
        "What training should organizations provide about inappropriate touching?",
        "How should management respond to inappropriate touching reports?",
        "What are legal requirements for organizations regarding inappropriate touching?",
        "What should teachers do if they suspect inappropriate touching?",
        "How should companies prevent inappropriate touching?",
        "What are best practices for handling inappropriate touching in organizations?",
        "What are a principal's duties regarding inappropriate touching reports?",
        "How should medical facilities handle inappropriate touching complaints?",
        "What should religious institutions do to prevent inappropriate touching?"
      ],
      "responses": [
        "Institutions have specific legal responsibilities regarding inappropriate touching. Educational institutions must: 1) Implement child protection policies aligned with POCSO Act. 2) Conduct mandatory background checks of employees. 3) Provide age-appropriate education on personal safety. 4) Establish clear reporting mechanisms. 5) Report any incidents involving minors to authorities immediately (mandatory under POCSO Act Section 19). Workplaces must: 1) Constitute Internal Complaints Committees as mandated by Sexual Harassment of Women at Workplace Act, 2013. 2) Display notices about sexual harassment consequences. 3) Conduct regular awareness programs. 4) Provide support to complainants. 5) Complete inquiry within 90 days. Failure to comply can result in penalties for the institution under respective laws.",
        "Institutions have critical responsibilities in handling inappropriate touching cases. Under Indian law, educational institutions must have dedicated child protection committees and follow mandatory reporting requirements under POCSO Act Section 19. Any staff member who fails to report known cases of child sexual abuse (including inappropriate touching) can face imprisonment. For workplaces, the Sexual Harassment Act mandates Internal Complaints Committees with external members, time-bound inquiry procedures (90 days), interim relief provisions, confidentiality protections, and prohibition of retaliation. Organizations should also provide regular training, clear reporting channels, and support services for affected individuals. These measures aren't just best practicesthey're legal requirements with penalties for non-compliance.",
        "Institutional responsibilities for addressing inappropriate touching are clearly defined in Indian law. Educational institutions must implement the following: 1) Mandatory reporting of any case involving minors to police within 24 hours (POCSO Act Section 19). 2) Age-appropriate prevention education. 3) Strict staff screening procedures. 4) Clear child protection policies. For workplaces, the Sexual Harassment Act requires: 1) Formation of Internal Complaints Committee with presiding officer (senior woman employee) and external member. 2) Defined procedure for complaint filing and inquiry. 3) Recommendations within 10 days of inquiry completion. 4) Implementation of recommendations within 60 days. 5) Annual reports to government authorities. All institutions must prioritize confidentiality, prevent victimization, and provide necessary support services to affected individuals."
      ]
    },
    {
      "tag": "psychological_impact",
      "patterns": [
        "What are the psychological effects of inappropriate touching?",
        "How does inappropriate touching affect mental health?",
        "What trauma can inappropriate touching cause?",
        "How do victims of inappropriate touching heal?",
        "What are the emotional impacts of being touched inappropriately?",
        "How long does trauma from inappropriate touching last?",
        "What therapy helps with inappropriate touching trauma?",
        "How does inappropriate touching affect children vs adults?",
        "What are common reactions to being touched inappropriately?",
        "How does inappropriate touching impact relationships?",
        "What are signs someone is suffering from inappropriate touching trauma?",
        "How to cope with feelings after being touched inappropriately?",
        "What mental health issues can arise from inappropriate touching?",
        "How does inappropriate touching affect self-esteem?",
        "What recovery process follows inappropriate touching?",
        "How to deal with flashbacks from inappropriate touching?",
        "What are long-term effects of inappropriate touching?",
        "How does inappropriate touching change a person?",
        "What healing resources exist for inappropriate touching victims?",
        "How to recognize trauma symptoms from inappropriate touching?"
      ],
      "responses": [
        "Inappropriate touching can cause significant psychological impacts including anxiety, depression, post-traumatic stress, sleep disturbances, and trust issues. Reactions vary based on individual factors, relationship to perpetrator, severity of incident, and available support. Recovery is possible through professional mental health support. While Indian law recognizes the criminal nature of such acts (IPC Sections 354/354A and POCSO Act), it also acknowledges victims' right to compensation for mental trauma under Section 357 of CrPC. The right to dignity under Article 21 of the Constitution extends to psychological well-being. If you're experiencing psychological distress, consider contacting mental health helplines like NIMHANS (080-26995000/5500) or seeking qualified therapists who specialize in trauma recovery.",
        "The psychological impact of inappropriate touching can be profound and varies by individual. Common reactions include shame, guilt, anxiety, depression, flashbacks, hypervigilance, and difficulty with trust or intimacy. These are normal responses to violation, not signs of weakness. While legal remedies exist through IPC Sections 354/354A and POCSO Act, healing the psychological impact often requires professional support. Trauma-focused cognitive behavioral therapy (TF-CBT) and EMDR therapy have shown effectiveness. The Indian legal system recognizes psychological harm through compensation provisions under CrPC Section 357. If you're struggling, consider reaching out to services like NIMHANS toll-free number (080-26995000/5500) or state mental health authorities. Remember that healing is possible and you deserve support.",
        "Inappropriate touching can cause significant psychological impacts that deserve attention and care. Common reactions include feelings of violation, anxiety, depression, difficulty with physical intimacy, flashbacks, and changes in sense of safety. For children, developmental impacts may include behavioral regression, academic difficulties, or inappropriate sexual knowledge. While seeking justice through legal channels (IPC Sections 354/354A) is important, addressing psychological healing is equally crucial. Professional counseling with trauma-informed therapists can provide effective support. In India, victims can access free counseling through One Stop Centres established under the Nirbhaya Fund. Remember that healing is not linear and varies for each person. With appropriate support and time, recovery is possible, though the experience may remain part of one's life story."
      ]
    },
    {
      "tag": "culturally_specific_issues",
      "patterns": [
        "How does Indian culture affect reporting of inappropriate touching?",
        "What cultural barriers exist for reporting inappropriate touching in India?",
        "How do cultural norms impact inappropriate touching cases?",
        "What cultural factors affect inappropriate touching in India?",
        "How is inappropriate touching viewed in Indian society?",
        "Why might victims in India not report inappropriate touching?",
        "How does family honor affect inappropriate touching cases in India?",
        "What cultural changes are needed regarding inappropriate touching?",
        "How do traditional values affect handling of inappropriate touching?",
        "What societal pressures exist around inappropriate touching in India?",
        "How do gender norms in India affect inappropriate touching cases?",
        "What cultural shifts are happening regarding inappropriate touching in India?",
        "How do community expectations affect inappropriate touching reporting?",
        "What cultural contexts matter in inappropriate touching cases?",
        "How does victim-blaming manifest in Indian inappropriate touching cases?",
        "What generational differences exist in views on inappropriate touching?",
        "How do urban vs rural settings affect inappropriate touching cases in India?",
        "What cultural education is needed about inappropriate touching?",
        "How do power dynamics in Indian society affect inappropriate touching?",
        "What cultural obstacles prevent addressing inappropriate touching?"
      ],
      "responses": [
        "In India, reporting inappropriate touching often faces cultural challenges including stigma, family honor concerns, victim-blaming attitudes, and power imbalances. Despite progressive laws (IPC Sections 354/354A, POCSO Act, Sexual Harassment Act), cultural barriers can discourage reporting. The Indian legal system has evolved to address these concerns through provisions like in-camera proceedings (private court sessions), prohibitions on revealing victim identity (IPC Section 228A), and statement recording by female officers (Section 154 CrPC). Culturally sensitive support services are increasingly available, including One Stop Centres for women. Despite challenges, awareness is growing through movements like #MeToo, and institutional mechanisms are strengthening. Remember that seeking justice is your constitutional right under Article 21, regardless of cultural pressures.",
        "Cultural factors significantly impact how inappropriate touching is addressed in India. Traditional notions of family honor ('izzat'), concerns about marriageability, and community judgment may discourage reporting. Gender norms often place unfair burden on victims rather than perpetrators. However, India's legal framework has evolved to counter these barriers - with strong protections under IPC Sections 354/354A, POCSO Act, and workplace protections. The judiciary has increasingly recognized that cultural factors shouldn't override individual rights to dignity and bodily autonomy guaranteed under Article 21. Support systems are expanding through One Stop Centres, women's helplines, and NGOs providing culturally sensitive assistance. While challenges remain, societal attitudes are gradually shifting toward greater accountability and support for survivors.",
        "In India, cultural contexts significantly impact inappropriate touching cases. Family reputation concerns, patriarchal norms, and community judgment can create barriers to reporting. Victims may face questions about their clothing, behavior, or why they were in certain locations - forms of victim-blaming that shift responsibility from perpetrators. However, India's legal framework firmly establishes that cultural factors cannot justify violations of bodily autonomy. The Supreme Court has repeatedly upheld that dignity and personal security are fundamental rights under Article 21. Progressive mechanisms include gender-sensitive investigation procedures (CrPC Section 154), protection officers under Domestic Violence Act, and mandatory ICCs under workplace harassment laws. While cultural change takes time, knowing your legal rights and available support systems can help navigate these challenges."
      ]
    },
    {
      "tag": "reporting_inappropriate_touching",
      "patterns": [
        "Someone touched my private parts without consent",
        "A person touched me inappropriately",
        "I was sexually harassed by someone touching me",
        "My colleague touched my private areas",
        "My teacher touched me inappropriately",
        "A relative touched my private parts",
        "Someone at work keeps touching me inappropriately",
        "I'm a victim of inappropriate touching",
        "A stranger touched my private areas without permission",
        "My boss touched me in a way that made me uncomfortable",
        "I think I was sexually assaulted through inappropriate touching",
        "Someone touched my body parts without my consent",
        "I experienced unwanted touching of my private areas",
        "Someone touched me in a sexual way without permission",
        "A family member touched my private parts",
        "I'm being sexually harassed through touching",
        "I was groped by someone",
        "Someone keeps touching my private areas",
        "I didn't give consent but they touched my private parts anyway",
        "I'm uncomfortable because someone touched me inappropriately"
      ],
      "responses": [
        "I'm very sorry this happened to you. What you've experienced is a form of sexual harassment which is illegal under Section 354A of the Indian Penal Code. Your experience is valid, and it's not your fault. I recommend documenting the incident(s), reporting it to the police, and considering speaking with a trusted person or counselor. You can file a complaint at your local police station or call the Women Helpline at 1091. Under Article 21 of the Indian Constitution, you have the right to dignity and personal liberty.",
        "Thank you for sharing this difficult experience. Inappropriate touching is a serious offense under Indian law, specifically covered by IPC Section 354 (assault or criminal force with intent to outrage modesty). Please consider filing a police complaint at your nearest station or dialing the Women Helpline (1091). Remember that the Protection of Children from Sexual Offences (POCSO) Act provides additional protection if the victim is a minor. Your safety and well-being are important, and there are resources available to help you.",
        "I understand how difficult sharing this must be. Inappropriate touching is a punishable offense under Section 354 of the IPC, with penalties including imprisonment up to 5 years. You have legal protections under Article 21 of the Constitution guaranteeing personal dignity. Please consider reporting this to authorities by visiting your local police station or calling the Women Helpline (1091). If you're comfortable, speak with a trusted family member, friend, or counselor for additional support. Remember, this was not your fault, and you deserve to feel safe."
      ]
    },
    {
      "tag": "witnessed_inappropriate_touching",
      "patterns": [
        "I saw someone touching another person inappropriately",
        "My friend told me they were touched inappropriately",
        "I witnessed inappropriate touching of a colleague",
        "My child says someone touched their private parts",
        "A student reported inappropriate touching by a staff member",
        "I think my friend is being sexually harassed through touching",
        "Someone I know was groped and told me about it",
        "My sibling says they were touched inappropriately",
        "A colleague confided in me about being touched inappropriately",
        "I overheard someone talking about being touched without consent",
        "My friend was a victim of inappropriate touching",
        "I know someone who experienced unwanted touching",
        "A child I know reported being touched inappropriately",
        "My friend complained about being touched in private areas",
        "Someone I care about was touched without consent",
        "A minor told me about inappropriate touching",
        "My employee reported being touched inappropriately",
        "Someone shared their experience of being groped",
        "A family member told me they were touched inappropriately",
        "I'm concerned about someone who was touched without consent"
      ],
      "responses": [
        "Thank you for being concerned about this serious matter. If the victim is a minor, this falls under the POCSO Act 2012, and reporting is mandatory. You can help by encouraging the person to file a police complaint (IPC Section 354 covers assault to outrage modesty) and being supportive. In case of a minor, please report to the nearest police station or call Childline at 1098 immediately. The National Commission for Women also provides assistance at their helpline 7827170170. Under Section 19 of the POCSO Act, reporting such incidents involving minors is legally required.",
        "I appreciate you looking out for others. Witnessing or hearing about such incidents can be distressing. Under Indian law, sexual harassment through touching is punishable under IPC Section 354A. If the victim is an adult, encourage them to file a complaint. If the victim is a minor, reporting is mandatory under the POCSO Act Section 19, and failure to report is punishable. You can help by listening supportively, offering to accompany them to authorities, and respecting their decisions about how to proceed.",
        "Your concern is commendable. In India, inappropriate touching constitutes sexual harassment under IPC Section 354 and 354A. For cases involving minors, the POCSO Act provides strict legal provisions. You should encourage the victim to document details and report to authorities. For workplace incidents, the Sexual Harassment of Women at Workplace (Prevention, Prohibition and Redressal) Act, 2013 requires organizations to have Internal Complaints Committees. Remember that supporting the victim without judgment is crucial during this difficult time."
      ]
    },
    {
      "tag": "what_to_do_after_inappropriate_touching",
      "patterns": [
        "What should I do if someone touched me inappropriately?",
        "How do I report inappropriate touching?",
        "Who should I talk to about being touched without consent?",
        "What are the steps to take after being touched inappropriately?",
        "How can I file a complaint for inappropriate touching?",
        "What actions should I take after experiencing unwanted touching?",
        "I was touched inappropriately, what now?",
        "How do I seek help after being inappropriately touched?",
        "What's the process for reporting someone who touched my private areas?",
        "Who can help me after I've been touched inappropriately?",
        "How should I respond to inappropriate touching?",
        "What should I do after sexual harassment through touching?",
        "How to deal with someone who touched me without consent?",
        "What are my options after experiencing inappropriate touching?",
        "How do I protect myself after being touched inappropriately?",
        "I want to report inappropriate touching but don't know how",
        "What's the right way to handle being touched inappropriately?",
        "How do I get justice after being touched inappropriately?",
        "What should be my first step after inappropriate touching?",
        "How should I proceed after someone touched my private parts?"
      ],
      "responses": [
        "After experiencing inappropriate touching, consider these steps: 1) Find a safe place and contact someone you trust. 2) Document everything (date, time, location, details of the incident, witnesses). 3) Report to the police as this falls under IPC Section 354 (outraging modesty) or 354A (sexual harassment). 4) If it occurred at work, report to your organization's Internal Complaints Committee as mandated by the Sexual Harassment of Women at Workplace Act, 2013. 5) Consider seeking medical attention if needed. 6) Connect with counseling services for emotional support. You can call Women Helpline (1091) or NCW Helpline (7827170170) for guidance.",
        "I'm sorry this happened to you. Here are the important steps to take: First, ensure your safety and, if possible, document the details of the incident. You can file an FIR at any police station under IPC Section 354 (assault or criminal force to woman with intent to outrage her modesty) which is punishable with imprisonment up to 5 years. If the victim is a minor, POCSO Act applies with more severe penalties. You may also approach the National Commission for Women or State Women's Commission for support. Remember, under Article 21 of the Constitution, your dignity and personal liberty are fundamental rights.",
        "After such an experience, prioritize your well-being. Consider these actions: 1) Reach out to someone you trust for immediate support. 2) Preserve evidence by writing down details and not washing clothes if relevant. 3) File a police complaint - inappropriate touching is covered under IPC Section 354 and 354A. 4) For workplace incidents, report to your organization's ICC as required by law. 5) Seek medical attention if needed. 6) Consider professional counseling to process the trauma. The law is on your side - Article 21 of the Constitution protects your dignity, and multiple sections of IPC provide legal recourse against such violations."
      ]
    },
    {
      "tag": "legal_consequences_for_perpetrators",
      "patterns": [
        "What happens to someone who touches others inappropriately?",
        "What are the legal consequences for inappropriate touching?",
        "Can someone go to jail for touching me inappropriately?",
        "What punishment is there for inappropriate touching in India?",
        "How does the law handle cases of inappropriate touching?",
        "What does Indian law say about inappropriate touching?",
        "Are there strict penalties for touching someone inappropriately?",
        "What sections of IPC cover inappropriate touching?",
        "How serious is the crime of inappropriate touching?",
        "Will someone be punished for touching private parts without consent?",
        "What legal action can be taken against someone who touched me inappropriately?",
        "What is the penalty for sexual harassment through touching?",
        "How are perpetrators of inappropriate touching punished?",
        "What happens if someone is found guilty of inappropriate touching?",
        "Are there different penalties for different types of inappropriate touching?",
        "What's the maximum sentence for inappropriate touching?",
        "How does Indian law punish people who touch others inappropriately?",
        "Can someone be arrested for touching private parts without consent?",
        "What legal sections apply to cases of inappropriate touching?",
        "How severely does the law treat inappropriate touching cases?"
      ],
      "responses": [
        "In India, inappropriate touching is a serious offense with significant legal consequences. Under Section 354 of the IPC (assault or criminal force to woman with intent to outrage her modesty), offenders can face imprisonment up to 5 years with fine. Section 354A specifically addresses sexual harassment including physical contact and advances involving unwanted physical contact, punishable with up to 3 years imprisonment. If the victim is a minor, the POCSO Act imposes even stricter penalties, including imprisonment of 3-5 years under Section 7 for sexual assault. These offenses are cognizable and non-bailable, meaning police can arrest without warrant and bail is at the court's discretion.",
        "Inappropriate touching carries serious legal consequences in India. The primary applicable law is IPC Section 354 (outraging modesty) which carries imprisonment of 1-5 years with fine. If it involves sexual harassment through physical contact, Section 354A applies with imprisonment up to 3 years or fine or both. In cases involving minors, the POCSO Act Section 7 (sexual assault) prescribes minimum 3 years imprisonment, extendable to 5 years with fine. Additionally, workplace incidents fall under the Sexual Harassment of Women at Workplace Act, 2013. These are all non-bailable offenses, meaning the accused cannot claim bail as a matter of right.",
        "Under Indian law, inappropriate touching is punishable with significant penalties. The specific charges depend on the circumstances but commonly include IPC Section 354 (assault or criminal force with intent to outrage modesty) carrying up to 5 years imprisonment and fine. For sexual harassment involving physical contact, Section 354A prescribes up to 3 years imprisonment and/or fine. For minors, POCSO Act Section 7 imposes minimum 3 years imprisonment (extendable to 5 years) with fine. These offenses are cognizable (police can arrest without warrant) and non-bailable. The courts take these matters seriously, recognizing them as violations of fundamental rights protected under Article 21 of the Constitution."
      ]
    },
    {
      "tag": "understanding_consent",
      "patterns": [
        "What counts as inappropriate touching?",
        "How do I know if touching is inappropriate?",
        "What is considered as touching without consent?",
        "Can you explain what inappropriate touching means?",
        "What's the definition of inappropriate touching?",
        "How can I tell if someone's touch is inappropriate?",
        "What makes touching inappropriate?",
        "Is touching private parts always inappropriate?",
        "What parts of the body should not be touched without consent?",
        "How do I understand consent for touching?",
        "What touching requires explicit consent?",
        "When does touching become inappropriate?",
        "I'm confused about what counts as inappropriate touching",
        "Can you help me understand inappropriate touching?",
        "What's the line between normal and inappropriate touching?",
        "How can I explain inappropriate touching to others?",
        "What's considered inappropriate touching under law?",
        "Are there different degrees of inappropriate touching?",
        "What should I know about consent and touching?",
        "How is inappropriate touching defined legally?"
      ],
      "responses": [
        "Inappropriate touching generally refers to any unwanted physical contact, especially with private parts of the body or with sexual intent. Under Indian law (IPC Section 354A), it includes physical contact involving unwelcome and explicit sexual overtures. Consent is fundamental - touching without clear permission, especially of private areas (genitals, buttocks, breasts, inner thighs) is inappropriate. Even non-private areas can be inappropriate to touch without consent. The key factors are: was permission given? Was the touch unwelcome? Did it make the person uncomfortable? Did it violate their bodily autonomy? Remember that consent should be enthusiastic, ongoing, and can be withdrawn at any time.",
        "Inappropriate touching refers to unwanted physical contact that violates a person's bodily autonomy, particularly touching of private parts (genitals, buttocks, breasts) without consent. Under Indian law, specifically IPC Section 354 and 354A, any physical contact with sexual intent without consent is considered sexual harassment. Consent must be explicit, informed, and freely given - not assumed, not coerced, and not given under influence of substances or fear. A person has the right to withdraw consent at any time. Cultural context doesn't justify inappropriate touching - everyone has the right to bodily autonomy protected under Article 21 of the Constitution regardless of relationship or setting.",
        "Inappropriate touching involves unwanted physical contact, particularly of intimate areas, without consent. Indian law recognizes this under IPC Section 354A as sexual harassment when there is physical contact and advances involving unwelcome and explicit sexual overtures. Key aspects to understand: 1) Consent must be clearly given, not assumed. 2) Private body parts (genitals, buttocks, breasts) should never be touched without explicit permission. 3) Even touching non-private areas can be inappropriate if unwanted. 4) Power dynamics (boss-employee, teacher-student) can make consent complicated. 5) A person in authority requesting sexual favors constitutes harassment under law. The foundation of appropriate touching is mutual respect and clear communication about boundaries."
      ]
    },
    {
      "tag": "helping_others",
      "patterns": [
        "How can I help someone who was touched inappropriately?",
        "What should I do if my friend was touched without consent?",
        "How to support someone who experienced inappropriate touching?",
        "My child was touched inappropriately, what should I do?",
        "Ways to help victims of inappropriate touching",
        "How to be there for someone who was touched inappropriately",
        "What's the best way to support victims of inappropriate touching?",
        "How should I respond when someone tells me they were touched inappropriately?",
        "What can I do for my friend who experienced unwanted touching?",
        "How to help family members who were touched inappropriately?",
        "What resources can I share with someone who was touched inappropriately?",
        "How should I react when someone discloses inappropriate touching?",
        "Best practices for supporting victims of inappropriate touching",
        "How to be an ally to someone who was touched without consent",
        "What not to say to someone who experienced inappropriate touching",
        "How to create a safe space for someone who was touched inappropriately",
        "What steps can I take to help someone after inappropriate touching?",
        "How can I provide emotional support to victims of inappropriate touching?",
        "What do victims of inappropriate touching need from supporters?",
        "How to help someone report inappropriate touching?"
      ],
      "responses": [
        "To support someone who experienced inappropriate touching: 1) Listen without judgment and believe them - many victims fear not being taken seriously. 2) Acknowledge their feelings and validate their experience. 3) Respect their decisions about reporting - filing a police complaint under IPC Section 354/354A is their choice unless it involves a minor (where reporting is mandatory under POCSO Act). 4) Help them document details if they wish to report. 5) Offer to accompany them to police or medical facilities. 6) Share resources like Women Helpline (1091) or NCW Helpline (7827170170). 7) Respect their privacy and don't share their story without permission. 8) Encourage professional counseling to help process trauma.",
        "Supporting someone after inappropriate touching requires sensitivity. Begin by believing them and listening attentively. Avoid questions that might sound like blame ('what were you wearing?' or 'why were you there?'). Acknowledge that under Article 21 of the Constitution and IPC Sections 354/354A, their bodily autonomy was violated. Offer practical support - accompanying them to file a police complaint, connecting them with counseling services, or helping them report to institutional authorities (like ICC at workplace under Sexual Harassment Act). For child victims, remember that reporting is mandatory under POCSO Act Section 19. Most importantly, follow their lead on what kind of support they need and respect their decisions.",
        "When supporting someone who experienced inappropriate touching: 1) Create a safe space for them to share without pressure. 2) Believe them unconditionally - false reports are extremely rare. 3) Emphasize it wasn't their fault - responsibility lies solely with the perpetrator. 4) Inform them about legal protections under IPC Section 354/354A and their constitutional right to dignity (Article 21). 5) Offer to help them document details and connect with authorities if they choose to report. 6) For workplace incidents, inform them about ICC procedures under the Sexual Harassment Act. 7) Respect their choices about reporting, unless mandatory (as with minors under POCSO). 8) Check in regularly but don't force them to discuss it. 9) Take care of your own emotional health while supporting them."
      ]
    },
    {
      "tag": "prevention_education",
      "patterns": [
        "How can we prevent inappropriate touching?",
        "What should children be taught about inappropriate touching?",
        "How to educate about good touch and bad touch?",
        "What are strategies to prevent inappropriate touching?",
        "How can organizations prevent inappropriate touching?",
        "What policies help prevent inappropriate touching?",
        "How to create awareness about inappropriate touching?",
        "What should schools teach about inappropriate touching?",
        "How to talk to children about private parts and consent?",
        "What are good resources for teaching about inappropriate touching?",
        "How to implement prevention programs for inappropriate touching?",
        "What training can prevent inappropriate touching at workplace?",
        "How to teach consent to prevent inappropriate touching?",
        "What should parents tell children about inappropriate touching?",
        "How can communities prevent inappropriate touching?",
        "What are effective ways to reduce incidents of inappropriate touching?",
        "How to create a culture that prevents inappropriate touching?",
        "What should everyone know to prevent inappropriate touching?",
        "How to teach body autonomy to prevent inappropriate touching?",
        "What preventive measures work against inappropriate touching?"
      ],
      "responses": [
        "Prevention of inappropriate touching requires education and system-level approaches. For children, age-appropriate education about 'good touch, bad touch' is essential - teaching that private parts (covered by underwear) shouldn't be touched by others except for health/hygiene by trusted caregivers. For broader prevention: 1) Educational institutions should implement awareness programs as mandated under POCSO Act Section 43. 2) Workplaces must constitute Internal Complaints Committees under the Sexual Harassment Act, 2013. 3) Communities should promote open conversations about consent. 4) Parents should teach children that their body belongs to them and they can say 'no' to unwanted touch. 5) Organizations should have clear codes of conduct and reporting mechanisms. These measures collectively help create safer environments.",
        "Preventing inappropriate touching requires comprehensive approaches. For children, teach body autonomy early - they have the right to refuse unwanted touch from anyone. Use correct anatomical terms for body parts and explain the 'swimsuit rule' (parts covered by swimwear are private). For organizations, strict implementation of the Sexual Harassment of Women at Workplace Act is crucial - with mandatory ICCs, clear reporting procedures, and regular training. Educational institutions must follow POCSO Act guidelines including background checks for staff. On a societal level, we need ongoing education about consent - that it must be enthusiastic, specific, and can be withdrawn. Creating environments where speaking up is encouraged and reports are taken seriously is fundamental to prevention.",
        "Effective prevention of inappropriate touching involves multiple strategies: 1) Early education - teach children about body boundaries, using correct anatomical terms for body parts, and that it's okay to say 'no' to unwanted touch. 2) Institutional safeguards - schools and organizations should implement proper vetting procedures for staff, clear codes of conduct, and appropriate supervision. 3) Legal awareness - educate communities about protections under IPC Sections 354/354A and POCSO Act. 4) Bystander intervention training - teach people how to safely intervene when they witness concerning behavior. 5) Creating reporting mechanisms that are accessible and responsive. 6) Challenging harmful cultural norms that minimize the importance of consent. Prevention is most effective when it combines education, policy implementation, and cultural change to create environments where respect for bodily autonomy is the norm."
      ]
    },
    {
      "tag": "institutional_responsibilities",
      "patterns": [
        "What should schools do about inappropriate touching?",
        "What are workplace responsibilities regarding inappropriate touching?",
        "How should organizations handle reports of inappropriate touching?",
        "What policies should be in place for inappropriate touching?",
        "What are an employer's legal obligations regarding inappropriate touching?",
        "How should institutions respond to inappropriate touching claims?",
        "What should universities do to prevent inappropriate touching?",
        "What are a school's responsibilities if a child reports inappropriate touching?",
        "How should HR handle inappropriate touching complaints?",
        "What processes should be in place for handling inappropriate touching?",
        "What's the protocol for inappropriate touching in institutions?",
        "What training should organizations provide about inappropriate touching?",
        "How should management respond to inappropriate touching reports?",
        "What are legal requirements for organizations regarding inappropriate touching?",
        "What should teachers do if they suspect inappropriate touching?",
        "How should companies prevent inappropriate touching?",
        "What are best practices for handling inappropriate touching in organizations?",
        "What are a principal's duties regarding inappropriate touching reports?",
        "How should medical facilities handle inappropriate touching complaints?",
        "What should religious institutions do to prevent inappropriate touching?"
      ],
      "responses": [
        "Institutions have specific legal responsibilities regarding inappropriate touching. Educational institutions must: 1) Implement child protection policies aligned with POCSO Act. 2) Conduct mandatory background checks of employees. 3) Provide age-appropriate education on personal safety. 4) Establish clear reporting mechanisms. 5) Report any incidents involving minors to authorities immediately (mandatory under POCSO Act Section 19). Workplaces must: 1) Constitute Internal Complaints Committees as mandated by Sexual Harassment of Women at Workplace Act, 2013. 2) Display notices about sexual harassment consequences. 3) Conduct regular awareness programs. 4) Provide support to complainants. 5) Complete inquiry within 90 days. Failure to comply can result in penalties for the institution under respective laws.",
        "Institutions have critical responsibilities in handling inappropriate touching cases. Under Indian law, educational institutions must have dedicated child protection committees and follow mandatory reporting requirements under POCSO Act Section 19. Any staff member who fails to report known cases of child sexual abuse (including inappropriate touching) can face imprisonment. For workplaces, the Sexual Harassment Act mandates Internal Complaints Committees with external members, time-bound inquiry procedures (90 days), interim relief provisions, confidentiality protections, and prohibition of retaliation. Organizations should also provide regular training, clear reporting channels, and support services for affected individuals. These measures aren't just best practicesthey're legal requirements with penalties for non-compliance.",
        "Institutional responsibilities for addressing inappropriate touching are clearly defined in Indian law. Educational institutions must implement the following: 1) Mandatory reporting of any case involving minors to police within 24 hours (POCSO Act Section 19). 2) Age-appropriate prevention education. 3) Strict staff screening procedures. 4) Clear child protection policies. For workplaces, the Sexual Harassment Act requires: 1) Formation of Internal Complaints Committee with presiding officer (senior woman employee) and external member. 2) Defined procedure for complaint filing and inquiry. 3) Recommendations within 10 days of inquiry completion. 4) Implementation of recommendations within 60 days. 5) Annual reports to government authorities. All institutions must prioritize confidentiality, prevent victimization, and provide necessary support services to affected individuals."
      ]
    },
    {
      "tag": "psychological_impact",
      "patterns": [
        "What are the psychological effects of inappropriate touching?",
        "How does inappropriate touching affect mental health?",
        "What trauma can inappropriate touching cause?",
        "How do victims of inappropriate touching heal?",
        "What are the emotional impacts of being touched inappropriately?",
        "How long does trauma from inappropriate touching last?",
        "What therapy helps with inappropriate touching trauma?",
        "How does inappropriate touching affect children vs adults?",
        "What are common reactions to being touched inappropriately?",
        "How does inappropriate touching impact relationships?",
        "What are signs someone is suffering from inappropriate touching trauma?",
        "How to cope with feelings after being touched inappropriately?",
        "What mental health issues can arise from inappropriate touching?",
        "How does inappropriate touching affect self-esteem?",
        "What recovery process follows inappropriate touching?",
        "How to deal with flashbacks from inappropriate touching?",
        "What are long-term effects of inappropriate touching?",
        "How does inappropriate touching change a person?",
        "What healing resources exist for inappropriate touching victims?",
        "How to recognize trauma symptoms from inappropriate touching?"
      ],
      "responses": [
        "Inappropriate touching can cause significant psychological impacts including anxiety, depression, post-traumatic stress, sleep disturbances, and trust issues. Reactions vary based on individual factors, relationship to perpetrator, severity of incident, and available support. Recovery is possible through professional mental health support. While Indian law recognizes the criminal nature of such acts (IPC Sections 354/354A and POCSO Act), it also acknowledges victims' right to compensation for mental trauma under Section 357 of CrPC. The right to dignity under Article 21 of the Constitution extends to psychological well-being. If you're experiencing psychological distress, consider contacting mental health helplines like NIMHANS (080-26995000/5500) or seeking qualified therapists who specialize in trauma recovery.",
        "The psychological impact of inappropriate touching can be profound and varies by individual. Common reactions include shame, guilt, anxiety, depression, flashbacks, hypervigilance, and difficulty with trust or intimacy. These are normal responses to violation, not signs of weakness. While legal remedies exist through IPC Sections 354/354A and POCSO Act, healing the psychological impact often requires professional support. Trauma-focused cognitive behavioral therapy (TF-CBT) and EMDR therapy have shown effectiveness. The Indian legal system recognizes psychological harm through compensation provisions under CrPC Section 357. If you're struggling, consider reaching out to services like NIMHANS toll-free number (080-26995000/5500) or state mental health authorities. Remember that healing is possible and you deserve support.",
        "Inappropriate touching can cause significant psychological impacts that deserve attention and care. Common reactions include feelings of violation, anxiety, depression, difficulty with physical intimacy, flashbacks, and changes in sense of safety. For children, developmental impacts may include behavioral regression, academic difficulties, or inappropriate sexual knowledge. While seeking justice through legal channels (IPC Sections 354/354A) is important, addressing psychological healing is equally crucial. Professional counseling with trauma-informed therapists can provide effective support. In India, victims can access free counseling through One Stop Centres established under the Nirbhaya Fund. Remember that healing is not linear and varies for each person. With appropriate support and time, recovery is possible, though the experience may remain part of one's life story."
      ]
    },
    {
      "tag": "culturally_specific_issues",
      "patterns": [
        "How does Indian culture affect reporting of inappropriate touching?",
        "What cultural barriers exist for reporting inappropriate touching in India?",
        "How do cultural norms impact inappropriate touching cases?",
        "What cultural factors affect inappropriate touching in India?",
        "How is inappropriate touching viewed in Indian society?",
        "Why might victims in India not report inappropriate touching?",
        "How does family honor affect inappropriate touching cases in India?",
        "What cultural changes are needed regarding inappropriate touching?",
        "How do traditional values affect handling of inappropriate touching?",
        "What societal pressures exist around inappropriate touching in India?",
        "How do gender norms in India affect inappropriate touching cases?",
        "What cultural shifts are happening regarding inappropriate touching in India?",
        "How do community expectations affect inappropriate touching reporting?",
        "What cultural contexts matter in inappropriate touching cases?",
        "How does victim-blaming manifest in Indian inappropriate touching cases?",
        "What generational differences exist in views on inappropriate touching?",
        "How do urban vs rural settings affect inappropriate touching cases in India?",
        "What cultural education is needed about inappropriate touching?",
        "How do power dynamics in Indian society affect inappropriate touching?",
        "What cultural obstacles prevent addressing inappropriate touching?"
      ],
      "responses": [
        "In India, reporting inappropriate touching often faces cultural challenges including stigma, family honor concerns, victim-blaming attitudes, and power imbalances. Despite progressive laws (IPC Sections 354/354A, POCSO Act, Sexual Harassment Act), cultural barriers can discourage reporting. The Indian legal system has evolved to address these concerns through provisions like in-camera proceedings (private court sessions), prohibitions on revealing victim identity (IPC Section 228A), and statement recording by female officers (Section 154 CrPC). Culturally sensitive support services are increasingly available, including One Stop Centres for women. Despite challenges, awareness is growing through movements like #MeToo, and institutional mechanisms are strengthening. Remember that seeking justice is your constitutional right under Article 21, regardless of cultural pressures.",
        "Cultural factors significantly impact how inappropriate touching is addressed in India. Traditional notions of family honor ('izzat'), concerns about marriageability, and community judgment may discourage reporting. Gender norms often place unfair burden on victims rather than perpetrators. However, India's legal framework has evolved to counter these barriers - with strong protections under IPC Sections 354/354A, POCSO Act, and workplace protections. The judiciary has increasingly recognized that cultural factors shouldn't override individual rights to dignity and bodily autonomy guaranteed under Article 21. Support systems are expanding through One Stop Centres, women's helplines, and NGOs providing culturally sensitive assistance. While challenges remain, societal attitudes are gradually shifting toward greater accountability and support for survivors.",
        "In India, cultural contexts significantly impact inappropriate touching cases. Family reputation concerns, patriarchal norms, and community judgment can create barriers to reporting. Victims may face questions about their clothing, behavior, or why they were in certain locations - forms of victim-blaming that shift responsibility from perpetrators. However, India's legal framework firmly establishes that cultural factors cannot justify violations of bodily autonomy. The Supreme Court has repeatedly upheld that dignity and personal security are fundamental rights under Article 21. Progressive mechanisms include gender-sensitive investigation procedures (CrPC Section 154), protection officers under Domestic Violence Act, and mandatory ICCs under workplace harassment laws. While cultural change takes time, knowing your legal rights and available support systems can help navigate these challenges."
      ]
    },
    {
      "tag": "emergency_medical_help",
      "patterns": [
        "I was just assaulted, what should I do?",
        "My friend was raped, what medical help does she need right now?",
        "I was sexually abused a few hours ago, do I need to go to a hospital?",
        "Someone I know was assaulted, what immediate medical steps should they take?",
        "I need urgent medical advice after being assaulted",
        "What are the immediate steps after sexual assault?",
        "Please help me, I was just assaulted and don't know what to do",
        "I'm scared and hurt after being attacked, what medical care do I need?",
        "My sister was attacked, what medical help should I get her?",
        "What should I do right after sexual assault for my health?",
        "I've been hurt and violated, what medical attention do I need?",
        "Need immediate medical advice after assault, please help",
        "What's the first thing to do medically after being raped?",
        "I was attacked yesterday, is it too late for medical help?",
        "Do I need emergency contraception after being assaulted?"
      ],
      "responses": [
        "I'm very sorry this happened. Your immediate health and safety are the priority. Please consider: 1) Going to a hospital emergency room or a specialized sexual assault center within 72 hours if possible. 2) Try not to wash, change clothes, or clean up as this might remove evidence, but your comfort is most important. 3) At the hospital, you can receive medical care, tests for STIs, emergency contraception if needed, and documentation of injuries. 4) You can call national helplines like 1098 (Childline) or 181 (Women's Helpline) for support and guidance. Remember, what happened was not your fault.",
        "I'm deeply sorry about what happened. For immediate medical care: Head to a hospital emergency department or rape crisis center as soon as possible. Medical professionals can provide emergency contraception (within 72 hours), prophylaxis against potential STIs, treatment for any injuries, and can collect forensic evidence if you choose to report. It's best to avoid showering or changing clothes before examination if possible, but your comfort matters most. You can contact support services at 1098 (Childline) or 181 (Women's Helpline) for guidance and emotional support. This wasn't your fault, and you deserve care.",
        "I'm so sorry you're going through this. For your health, please try to visit a hospital or sexual assault care center as soon as possible. Medical professionals can provide crucial care including: treating injuries, preventing pregnancy (if within 72 hours), preventing STIs, and documenting evidence if you wish. If possible, try not to shower or change clothes before the exam, but your comfort comes first. Remember you can call 1098 (Childline) or 181 (Women's Helpline) anytime. This situation is not your fault, and you deserve support and healing."
      ]
    },
    {
      "tag": "std_testing",
      "patterns": [
        "Should I get tested for STDs after sexual assault?",
        "How soon can I get tested for infections after being assaulted?",
        "I'm worried about diseases after what happened to me",
        "When should I get STI testing done after assault?",
        "What tests should I get after being raped?",
        "I'm scared I might have caught something from my attacker",
        "How long after assault should I wait to get tested for STIs?",
        "My friend was assaulted and is worried about infections, what should she do?",
        "Is it necessary to get STD testing after assault?",
        "What infections am I at risk for after sexual abuse?",
        "Do all hospitals test for STDs after assault?",
        "Can I get HIV from being assaulted?",
        "What's the timeline for STI testing after rape?",
        "Should I be worried about infections after being violated?",
        "Does sexual assault put me at risk for diseases?"
      ],
      "responses": [
        "STI testing is an important part of care after sexual assault. Initially, baseline tests may be done at your first medical visit, though many infections won't show up immediately. Typically, follow-up testing is recommended after 2 weeks, 6 weeks, 3 months, and 6 months. Tests usually include screening for chlamydia, gonorrhea, trichomoniasis, syphilis, HIV, hepatitis B, and sometimes herpes. Many hospitals provide preventive medication (prophylaxis) for common STIs right away, without waiting for test results. Remember, taking care of your health after assault is important and medical professionals understand the sensitivity of your situation.",
        "It's medically recommended to get STI testing after sexual assault. The testing timeline is important: initial baseline tests at your first medical visit, followed by tests at 2 weeks, 6 weeks, 3 months, and sometimes 6 months depending on exposure risks. Healthcare providers typically test for common infections like chlamydia, gonorrhea, trichomoniasis, syphilis, HIV, and hepatitis B. Many hospitals offer preventive medications immediately after assault to protect against several common infections. These medications are most effective when taken early. Please know that healthcare providers who work with sexual assault survivors are trained to be compassionate and non-judgmental.",
        "Yes, STI testing is an important health measure after sexual assault. The typical protocol includes initial testing during your first medical examination and follow-up tests at several intervals (2 weeks, 6 weeks, 3 months, and sometimes 6 months) since different infections have different window periods for detection. Tests usually cover chlamydia, gonorrhea, trichomoniasis, syphilis, HIV, and hepatitis B. Doctors often provide preventive medications immediately after the assault to protect against common infections, which is why seeking medical care promptly is beneficial. Please know that healthcare providers are trained to provide this care sensitively, and the testing is for your health protection."
      ]
    },
    {
      "tag": "pregnancy_concerns",
      "patterns": [
        "Can I get pregnant from being raped?",
        "I was assaulted, how do I prevent pregnancy?",
        "What are my options if I get pregnant from assault?",
        "How effective is emergency contraception after rape?",
        "My friend was assaulted and is worried about pregnancy",
        "How long do I have to take emergency contraception after assault?",
        "I'm scared I might be pregnant after what happened",
        "Is the morning after pill available for assault victims?",
        "What should I do if I find out I'm pregnant after rape?",
        "How soon can I take a pregnancy test after sexual assault?",
        "Do hospitals provide emergency contraception to assault victims?",
        "I can't stop worrying about pregnancy after being attacked",
        "Will I know right away if I'm pregnant from the assault?",
        "What are my rights regarding pregnancy from sexual violence?",
        "I was raped during my fertile period, what should I do?"
      ],
      "responses": [
        "Yes, pregnancy can occur from sexual assault. Emergency contraception (EC) pills can be effective if taken within 72-120 hours (3-5 days) after the assault, with higher effectiveness the sooner they're taken. Hospitals and sexual assault care centers typically offer EC to patients. If you're concerned about pregnancy, seek medical care as soon as possible. If pregnancy does occur, you have options including continuing the pregnancy, adoption, or termination (legal in India in cases of rape). A healthcare provider can discuss these options and provide support. Remember that specialized counseling services can help you process these difficult decisions.",
        "Pregnancy is a valid concern after sexual assault. Emergency contraception is most effective when taken as soon as possible after the incident, ideally within 72 hours, though some types work up to 5 days. Most hospitals and sexual assault care centers provide this medication. If you're worried about pregnancy, please seek medical care promptly. If pregnancy does occur, you have several legal options in India, including continuing the pregnancy, adoption, or medical termination (which is legal in cases of rape under the Medical Termination of Pregnancy Act). Healthcare providers and counselors can provide confidential guidance and support for whatever decision feels right for you.",
        "Your concern about pregnancy is completely understandable. If the assault was recent (within 5 days), emergency contraception can help prevent pregnancy, with better effectiveness the sooner it's taken (ideally within 72 hours). This medication is available at hospitals, many pharmacies, and sexual assault care centers. For pregnancy testing, it's most accurate to wait until after your first missed period. If pregnancy does occur, Indian law supports your right to choose, including termination in cases of rape (under the Medical Termination of Pregnancy Act). Please know that medical professionals and counselors are available to support you through these difficult decisions without judgment."
      ]
    },
    {
      "tag": "physical_injuries",
      "patterns": [
        "I have injuries from sexual assault, what should I do?",
        "My friend is bleeding after being attacked, where should we go?",
        "How do I know if my injuries from assault need medical attention?",
        "I have pain after being assaulted, should I see a doctor?",
        "What kind of injuries are common after sexual assault?",
        "My body hurts after being raped, what should I do?",
        "I have bruises and cuts from assault, do I need treatment?",
        "Are internal injuries common after sexual assault?",
        "How long will physical pain from assault last?",
        "Should I document my injuries after being attacked?",
        "I didn't see obvious injuries after assault, should I still get checked?",
        "My sister has wounds from being assaulted, where can she get help?",
        "I'm in pain days after being assaulted, is this normal?",
        "How can I treat injuries from sexual violence at home?",
        "What medical complications can happen from assault injuries?"
      ],
      "responses": [
        "If you have injuries from sexual assault, it's important to seek medical care right away, even if the injuries seem minor. Hospital emergency departments can provide comprehensive care for both visible injuries (like cuts, bruises, or tears) and potential internal injuries that may not be immediately apparent. Medical documentation of injuries can also be important if you choose to report the assault. Even without visible injuries, internal damage or infections may be present, so a medical examination is still recommended. Please don't hesitate to seek help - healthcare providers are trained to provide compassionate care to survivors of sexual assault.",
        "For injuries related to sexual assault, immediate medical attention is recommended. Hospitals can treat visible wounds, check for internal injuries, provide pain relief, and document injuries for potential legal purposes. Both external injuries (bruising, cuts, tears) and internal injuries (which may cause pain or bleeding) should be evaluated by medical professionals. Even if injuries seem minor or aren't immediately visible, complications can develop later. Please consider going to an emergency department or sexual assault care center where staff are trained to provide trauma-informed care. Your health and recovery are the priority.",
        "I'm sorry you're dealing with injuries. Please consider seeking medical care promptly for any injuries from sexual assault. Healthcare providers can assess both visible and internal injuries, provide appropriate treatment, manage pain, and check for complications. They can also document injuries if you decide to report the assault. Even without obvious external signs, internal injuries may be present and require attention. Medical staff who work with assault survivors are trained to be gentle, respectful, and understanding of the emotional sensitivity involved. Your wellbeing matters, and proper medical care is an important part of the healing process."
      ]
    },
    {
      "tag": "emotional_support",
      "patterns": [
        "I can't stop crying after being assaulted",
        "I feel dirty and ashamed after what happened to me",
        "My friend was raped and she's not the same, how can I help her?",
        "I'm having nightmares and flashbacks after the assault",
        "Is it normal to feel numb after sexual abuse?",
        "I don't know how to cope with what happened to me",
        "Sometimes I blame myself for being assaulted",
        "I'm afraid all the time since I was attacked",
        "Will I ever feel normal again after sexual assault?",
        "How do I tell my family I was abused?",
        "I feel like no one understands what I'm going through",
        "My friend told me she was assaulted and I don't know what to say",
        "I'm having panic attacks since the rape",
        "How long will it take to recover emotionally from sexual abuse?",
        "I feel so alone after what happened to me"
      ],
      "responses": [
        "What you're feeling is a normal response to trauma. Many survivors experience a range of emotions including sadness, shame, fear, numbness, anger, or guilt - all of these responses are valid. Please know that what happened was not your fault, regardless of the circumstances. Consider reaching out to a mental health professional who specializes in trauma, as they can provide coping strategies for symptoms like flashbacks, nightmares, and anxiety. Support groups can also help reduce feelings of isolation by connecting you with others who understand. Organizations like RAHI Foundation (rahifoundation.org) or SNEHA (snehamumbai.org) offer specialized support. Healing takes time and isn't linear, but with proper support, recovery is possible.",
        "I'm so sorry you're going through this difficult time. The emotions you're experiencing - whether intense feelings or numbness - are natural responses to trauma. Please remember that the assault was never your fault, and you deserve support. Speaking with a trauma-informed counselor can be incredibly helpful, as they can provide strategies for managing flashbacks, anxiety, and other trauma responses. Connecting with support services like Childline (1098) or Women's Helpline (181) can connect you with appropriate resources. Many survivors find that joining support groups helps them feel less alone. Healing isn't a straight line and happens at your own pace, but with support, many survivors find they can rebuild their sense of safety and well-being.",
        "I hear you, and what you're feeling is a completely understandable reaction to trauma. Many survivors experience similar emotions - from overwhelming feelings to numbness, from self-blame to anger. These are all normal responses to an abnormal situation. Please know that healing is possible, though it takes time and often professional support. Consider reaching out to a counselor experienced in trauma, particularly sexual violence. Organizations like RAHI Foundation, SNEHA, or Childline (1098) can connect you with appropriate services. Be patient with yourself through this process - recovery isn't linear, and healing happens gradually. With support, many survivors find they can process their trauma and rebuild their sense of safety and control."
      ]
    },
    {
      "tag": "reporting_options",
      "patterns": [
        "Should I report my sexual assault to the police?",
        "What happens if I file a police report about being raped?",
        "Can I get medical help without reporting to police?",
        "I'm scared to report my attacker, what should I do?",
        "How do I report sexual abuse in India?",
        "Will the police believe me if I report assault?",
        "What evidence do I need to report sexual assault?",
        "Can I report assault anonymously?",
        "My family doesn't want me to report being assaulted",
        "I was assaulted months ago, is it too late to report?",
        "What are my rights when reporting sexual violence?",
        "I'm a minor who was abused, how do I report it?",
        "I know who attacked me but I'm afraid to tell police",
        "What happens during a police interview for assault?",
        "Do I need a lawyer to report sexual assault?"
      ],
      "responses": [
        "The decision to report sexual assault is entirely yours. In India, you can receive medical care regardless of whether you report to police. If you decide to report, you can file an FIR at any police station (they're required to register it even if the crime occurred elsewhere). You have the right to file the report in your preferred language, receive a free copy of the FIR, and have a female officer record your statement in a private setting. Medical examination requires your consent (or guardian's for minors). There's no time limit for reporting sexual assault in India, though evidence collection is easier sooner. Organizations like Childline (1098) or Women's Helpline (181) can provide an advocate to support you through the process if needed.",
        "You have the right to medical care whether or not you choose to report the assault to authorities. If you decide to report in India, the process typically involves filing a First Information Report (FIR) at a police station. The police are legally required to register sexual assault cases and provide a free copy of the FIR. You have the right to have your statement recorded by a female officer in a private setting. For medical examination, your explicit consent is required (or guardian's consent for minors). Remember that there is no time limitation for reporting sexual assault crimes in India, though evidence collection is more effective sooner. Support services like Childline (1098) can provide guidance and advocates to accompany you through the reporting process.",
        "This is a personal decision, and both choices are valid. You can absolutely receive medical care without involving police. If you do choose to report in India, you can file an FIR at any police station (they must register it even if the crime happened elsewhere). Your rights include: having a female officer take your statement in privacy, receiving a free copy of the FIR, giving consent before any medical examination, and having a support person present if you wish. Under Indian law, there's no time limit for reporting sexual assault, though evidence collection becomes more challenging with time. Support organizations like Women's Helpline (181) can provide advocates to help navigate the reporting process and explain what to expect at each step."
      ]
    },
    {
      "tag": "legal_information",
      "patterns": [
        "What are my legal rights after sexual assault in India?",
        "What legal punishment is there for rapists in India?",
        "How does the legal process work for sexual assault cases?",
        "What laws protect sexual assault victims in India?",
        "Can I get compensation after being sexually assaulted?",
        "What happens in court for sexual assault cases?",
        "Will my identity be protected if I take legal action?",
        "How long do rape trials take in India?",
        "What evidence is needed to convict a rapist?",
        "I'm a minor who was abused, what legal protections do I have?",
        "What are the new laws about sexual violence in India?",
        "Can I take legal action if the assault happened years ago?",
        "What legal support is available for sexual assault survivors?",
        "Will I have to face my attacker in court?",
        "What should I expect during a sexual assault trial?"
      ],
      "responses": [
        "In India, several laws protect sexual assault survivors. Under the Indian Penal Code (IPC), sexual assault and rape are covered primarily by Sections 375, 376, 354, and 509. For minors, the POCSO Act provides additional protections. Your legal rights include: confidentiality (Section 228A of IPC prohibits disclosing a victim's identity), in-camera trials (private courtroom proceedings), free legal aid, medical examination only with consent, and potential compensation through victim compensation schemes. The Criminal Law Amendment Act, 2013 strengthened these protections following the 2012 Delhi case. For specialized legal assistance, consider contacting organizations like the National Commission for Women or legal aid services available at district courts.",
        "Indian law provides several protections for sexual assault survivors. The Indian Penal Code Sections 375 and 376 define and punish rape (with penalties ranging from 7 years to life imprisonment depending on circumstances). Section 354 covers assault or criminal force against women, and Section 509 addresses words, gestures, or acts intended to insult a woman's modesty. For children, the POCSO Act of 2012 provides comprehensive protection. Your legal rights include identity protection (Section 228A of IPC), private court proceedings, legal representation, and potential compensation through state victim compensation schemes. Recent amendments have strengthened these laws, including the Criminal Law Amendment Act of 2013 and the Criminal Law Amendment Act of 2018, which introduced more severe penalties including death penalty in certain cases.",
        "Your legal rights in India include comprehensive protections under both the Indian Penal Code and special legislation. Sexual offenses are primarily covered under IPC Sections 375 (rape), 376 (punishment for rape), 354 (assault with intent to outrage modesty), and 509 (insulting the modesty of a woman). The POCSO Act provides additional protections for minors. Your rights include: confidentiality protection (Section 228A prohibits revealing a victim's identity), in-camera trials, free legal aid under the Legal Services Authorities Act, medical examination only with consent (Section 164A CrPC), and compensation through victim compensation schemes established under Section 357A CrPC. Recent judicial interpretations have further strengthened these protections. For specialized legal guidance, the National Legal Services Authority or state women's commissions can provide resources."
      ]
    },
    {
      "tag": "confidentiality_concerns",
      "patterns": [
        "Will people find out if I get medical help after assault?",
        "Are medical records from rape examination private?",
        "I don't want anyone to know I was assaulted",
        "Can I get tested for STDs confidentially after assault?",
        "Who will know if I report sexual abuse?",
        "Will my family find out if I seek help after being raped?",
        "How confidential are rape crisis services?",
        "Can I keep my assault private from my parents?",
        "I'm worried about privacy when getting medical help",
        "Will my identity be protected if I seek help?",
        "Can school/college find out if I was sexually abused?",
        "I'm afraid of people gossiping if they find out I was assaulted",
        "How can I get help without everyone knowing what happened?",
        "Who has access to sexual assault medical records?",
        "I need help but I'm worried about confidentiality"
      ],
      "responses": [
        "Medical care for sexual assault is confidential, and healthcare providers are bound by confidentiality laws. Your medical records are private and can only be released with your consent (except in certain circumstances for minors where parents/guardians may need to be informed, or if reporting is mandatory under POCSO Act for those under 18). If you choose to report to police, Section 228A of the Indian Penal Code prohibits disclosing the identity of sexual assault survivors - this is a punishable offense. Court proceedings in sexual assault cases are typically conducted 'in-camera' (privately). Many hospitals and organizations offer specialized services where maintaining your privacy is a priority. You can ask any provider about their confidentiality policies before sharing information.",
        "Your privacy concerns are completely valid. Healthcare services for sexual assault are confidential, with medical records protected under law. For adults, medical information is shared only with your permission (though for minors, parents/guardians may need to be informed in some cases, and cases involving minors must be reported under the POCSO Act). If you report to authorities, your identity is legally protected - Section 228A of the IPC makes it illegal to disclose a sexual assault survivor's identity. You can request specific confidentiality measures when seeking help, such as private appointments or discussing exactly who will have access to your information. Many sexual assault support services are experienced in helping survivors who have privacy concerns and can work with you to address these issues.",
        "Confidentiality is a critical aspect of sexual assault care. Your medical records are protected by confidentiality laws and ethics codes that bind healthcare providers. Adult survivors can generally control who has access to their information (though there are mandatory reporting requirements for minors under the POCSO Act). If you report to police, your identity is protected by law - Section 228A of the IPC prohibits media or anyone from disclosing a sexual assault survivor's identity. Most specialized sexual assault services understand privacy concerns and have protocols to protect confidentiality. You can always ask providers about their specific confidentiality policies before proceeding, including asking exactly who will have access to your information and under what circumstances information might need to be shared."
      ]
    },
    {
      "tag": "assault_by_known_person",
      "patterns": [
        "I was assaulted by someone I know, what should I do?",
        "My boyfriend forced himself on me, was that rape?",
        "I was abused by a family member, who can I tell?",
        "My friend assaulted me, will anyone believe me?",
        "I was raped by my husband, is that a crime in India?",
        "Someone I trusted sexually abused me",
        "My teacher touched me inappropriately, what can I do?",
        "I was drugged and assaulted at a party by an acquaintance",
        "My uncle has been molesting me, who can help?",
        "I'm scared to report because my attacker is well-known",
        "If I was assaulted by a relative, will they go to jail?",
        "My parents don't believe I was abused by someone we know",
        "My boss sexually assaulted me, what are my options?",
        "I live with the person who abused me, what can I do?",
        "Can assault by a family member be reported?"
      ],
      "responses": [
        "First, please know that sexual assault is never your fault, regardless of your relationship with the perpetrator. In India, the law recognizes sexual assault by known persons, including family members, partners, and spouses (marital rape is a criminal offense in certain circumstances, such as if the wife is under 18 or living separately under decree). All the medical care options we've discussed are available to you. For safety, consider if you need alternative living arrangements if you share housing with the perpetrator. Organizations like Childline (1098) or Women's Helpline (181) can help with safety planning and support. Under the Protection of Women from Domestic Violence Act, you may be eligible for protection orders. Your healing and safety are the priority, and support is available regardless of your relationship to the perpetrator.",
        "Sexual assault by someone you know is unfortunately common and no less serious than assault by a stranger. In India, the law recognizes such assaults as crimes. For spouses, marital rape is criminalized in specific circumstances such as when the wife is under 18 or when spouses are living separately under judicial separation. You deserve the same medical care, emotional support, and legal options as any survivor. If you live with the perpetrator, safety planning becomes especially important - organizations like Childline (1098) or Women's Helpline (181) can help with this, including information about protection orders under the Protection of Women from Domestic Violence Act. Many survivors find it particularly difficult to disclose or report assault by someone they know, but specialized counseling services can help you process these complicated feelings.",
        "I'm very sorry this happened to you. Sexual assault by someone you know is a violation of both trust and law. In India, the relationship between you and the perpetrator doesn't diminish the criminality of the act (though marital rape is only criminalized in specific circumstances such as when the wife is under 18). You may face unique challenges, including safety concerns if you regularly encounter this person, pressure from mutual connections, or complicated feelings of betrayal. All medical and support services we've discussed are available to you. Organizations specializing in sexual assault can help with safety planning if needed. The Protection of Women from Domestic Violence Act may provide additional protections if applicable. Please remember that betrayal by someone you trusted doesn't reflect on you - the responsibility lies solely with the perpetrator."
      ]
    },
    {
      "tag": "delayed_seeking_help",
      "patterns": [
        "I was assaulted weeks ago but didn't tell anyone, is it too late for help?",
        "Can I still get medical care months after sexual assault?",
        "I didn't report my rape when it happened, what can I do now?",
        "Is it too late for evidence collection after assault?",
        "I've been hiding my abuse for years, can I still get help?",
        "I just realized what happened to me was assault, is it too late?",
        "I was in denial about being raped and now need help",
        "Can I still press charges years after sexual abuse?",
        "What medical care should I get if assault happened long ago?",
        "I didn't get help right away after assault, what should I do now?",
        "Is there a time limit for reporting sexual assault in India?",
        "I was abused as a child and never told anyone until now",
        "Can doctors still help me weeks after being assaulted?",
        "I was too scared to get help after assault, what now?",
        "What kind of evidence exists long after sexual assault?"
      ],
      "responses": [
        "It's never too late to seek help after sexual assault. While some medical interventions (like emergency contraception or evidence collection) are time-sensitive, many important services remain available regardless of when the assault occurred. You can still benefit from STI testing, physical exam for lingering injuries, mental health support, and legal consultation. In India, there is no statute of limitations for reporting sexual assault crimes, meaning you can still file a police report even years later. Many survivors delay seeking help due to shock, fear, shame, or other valid reasons. Support services understand this and are equipped to help regardless of when the assault occurred. Organizations like RAHI Foundation specialize in supporting survivors of non-recent abuse.",
        "Please know that many survivors don't seek help immediately, and support services understand this completely. While certain medical interventions (like emergency contraception or forensic evidence collection) are most effective shortly after assault, many important services remain available regardless of when the assault occurred. You can still access medical care for any ongoing physical issues, STI testing, mental health support, and legal advice. Under Indian law, there is no time limitation for reporting sexual assault crimes. This means you can still file a police report even years after the incident. Counseling services can be particularly helpful in processing delayed reactions to trauma. Organizations like RAHI Foundation and SNEHA have experience supporting survivors who delayed seeking help.",
        "It's absolutely not too late to seek support. Many survivors don't immediately recognize what happened or feel able to seek help right away. While certain medical interventions have time windows (like emergency contraception within 72-120 hours or evidence collection within a few days), many important services remain available to you. These include medical care for any persistent physical issues, STI testing, mental health support, and legal consultation. Indian law allows for reporting sexual assault cases regardless of when they occurred - there is no statute of limitations for these crimes. Support organizations understand delayed disclosure is common and are prepared to help survivors at any point in their journey. Your experiences and needs are valid regardless of when you seek help."
      ]
    },
    {
      "tag": "prevention_future_assault",
      "patterns": [
        "How can I protect myself from being assaulted again?",
        "I'm afraid of being attacked again, what can I do?",
        "What safety measures can prevent sexual assault?",
        "How do I feel safe again after being raped?",
        "I'm paranoid about another attack, how do I cope?",
        "Are there ways to reduce risk of sexual assault?",
        "How can I help my friend avoid being assaulted?",
        "I don't feel safe anymore after what happened",
        "What self-defense methods work best against assault?",
        "How can girls protect themselves from abuse?",
        "I'm scared to go out alone after being attacked",
        "What should I teach my daughter about preventing assault?",
        "How can I avoid dangerous situations?",
        "I have panic attacks thinking about being attacked again",
        "What safety apps are available for women in India?"
      ],
      "responses": [
        "First, please remember that if assault happens, it's never the victim's fault - responsibility always lies with the perpetrator. That said, some safety strategies that may help include: being aware of your surroundings, trusting your instincts about uncomfortable situations, maintaining regular communication with trusted people about your whereabouts, considering safety apps like Himmat, Nirbhaya, or SafetiPin. Self-defense classes can provide practical skills and boost confidence. For emotional safety, therapy approaches like Cognitive Processing Therapy or EMDR can help process trauma and reduce hypervigilance. Creating a safety plan with specific strategies for different situations may help you regain a sense of control. Remember that healing takes time, and working with a trauma-informed counselor can help balance reasonable caution with living your life fully.",
        "Your concern about future safety is completely understandable after experiencing assault. While no strategy can guarantee safety (and assault is never the victim's fault), some approaches that survivors find helpful include: maintaining awareness of surroundings, communicating plans with trusted people, learning about boundary-setting, considering safety apps like Himmat or SafetiPin, and possibly taking self-defense classes. For emotional safety, trauma-focused therapy can help process feelings of vulnerability and develop coping strategies for anxiety and hypervigilance. Many survivors work with counselors to create personalized safety plans that help them gradually reengage with activities while respecting their comfort levels. Support groups can also provide valuable insights from others who have navigated similar concerns. Remember that healing is a gradual process of rebuilding your sense of safety in the world.",
        "Your feelings about safety are a normal response to trauma. While it's important to emphasize that sexual assault is always the perpetrator's responsibility, some strategies many survivors find helpful include: staying connected with trusted support people, being aware of surroundings particularly in isolated or unfamiliar places, considering safety tools like personal alarms or apps (Shake2Safety, bSafe, SafetiPin), setting clear boundaries in relationships, and potentially learning self-defense techniques. Working with a trauma-informed therapist can help address hypervigilance and anxiety while developing a balanced approach to safety. Creating a personalized safety plan that addresses your specific concerns may help restore some sense of control. Remember that feeling safe again takes time, and it's okay to prioritize your comfort as you gradually reengage with activities at your own pace."
      ]
    },
    {
      "tag": "impact_on_relationships",
      "patterns": [
        "I'm afraid of intimacy after being assaulted",
        "How do I tell my partner about my sexual assault?",
        "Will I ever be able to trust people again after rape?",
        "I can't be intimate with my boyfriend since the assault",
        "My assault is affecting my relationship",
        "How do sexual abuse survivors have healthy relationships?",
        "I panic when my partner touches me after the assault",
        "Should I tell future partners about my assault?",
        "My boyfriend doesn't understand my trauma responses",
        "How long until I feel comfortable with physical touch again?",
        "I feel disconnected from my partner since being assaulted",
        "Dating feels scary after sexual assault",
        "How can my partner support me after sexual trauma?",
        "Will I ever enjoy physical intimacy again after abuse?",
        "My relationship is suffering because of my assault trauma"
      ],
      "responses": [
        "Sexual assault can significantly impact relationships and intimacy, and your feelings are a normal response to trauma. Many survivors experience changes in how they feel about physical touch, trust, and emotional connection. Communication with partners about boundaries and triggers can help, though sharing your experience should always be your choice when you feel ready. Trauma-focused therapy, particularly approaches that address intimacy issues, can be beneficial. Remember that healing is gradual - many survivors do eventually develop healthy, fulfilling relationships, though the timeline varies for everyone. Partners can support recovery by being patient, respectful of boundaries, and possibly participating in couples counseling. Your needs and pace deserve respect as you navigate this aspect of healing.",
        "The impact of sexual assault on relationships and intimacy is very real and varies from person to person. Difficulties with trust, physical intimacy, and communication are common responses to trauma. When and how to share your experience with partners is entirely your decision - there's no right or wrong approach. Some survivors find that couples counseling or providing partners with educational resources about trauma helps build understanding. Trauma-focused therapy can also address intimacy concerns specifically. Many survivors gradually regain comfort with physical and emotional intimacy at their own pace. Setting clear boundaries, developing signals with partners for when you need space, and practicing self-compassion during setbacks are all strategies that can support healing in relationships.",
        "Your concerns about relationships after assault are completely valid. Sexual trauma can affect how we experience trust, boundaries, and physical intimacy. These changes are natural responses to trauma, not permanent barriers to healthy relationships. Many survivors find that with support and time, they can develop fulfilling relationships, though the healing process isn't linear. Working with a trauma-informed therapist can help address specific intimacy concerns. When you feel ready (and only if you choose to), communicating with partners about your needs, boundaries, and potential triggers can help them understand how to support you. Remember that healing happens at your own pace, and it's okay to prioritize your comfort and safety as you navigate relationships after trauma."
      ]
    },
    {
      "tag": "medication_queries",
      "patterns": [
        "What medications will I be given after sexual assault?",
        "Are there medicines to prevent STDs after rape?",
        "What is PEP medication after sexual assault?",
        "Will I need to take HIV prevention drugs?",
        "How effective are medications after sexual assault?",
        "I'm worried about side effects of post-assault medications",
        "What emergency medications are given after rape?",
        "How long do I need to take STI prevention medicines?",
        "My doctor prescribed pills after assault, what are they for?",
        "Do hospitals provide emergency contraception after assault?",
        "What does the morning after pill do?",
        "Will medications after assault affect my other medicines?",
        "Are post-assault medications covered by insurance?",
        "Can I refuse medications after sexual assault?",
        "What if I miss a dose of my post-assault medication?"
      ],
      "responses": [
        "After sexual assault, healthcare providers may offer several medications based on your specific situation and timing: 1) Emergency contraception (like I-Pill or Unwanted-72) to prevent pregnancy if taken within 72-120 hours. 2) Prophylactic antibiotics to prevent common STIs like chlamydia, gonorrhea, and sometimes syphilis. 3) Post-Exposure Prophylaxis (PEP) for HIV prevention if the assault presents risk factors - this must be started within 72 hours and continued for 28 days. 4) Tetanus vaccine if you have wounds and aren't up-to-date. 5) Anti-anxiety medication in some cases. All medications should be explained to you, including potential side effects, and you have the right to ask questions and make informed decisions about your care. Your consent is required before any medication is administered.",
        "Healthcare providers typically offer several medications after sexual assault: Emergency contraception (preventing pregnancy if taken within 3-5 days, with greater effectiveness earlier); antibiotics to prevent bacterial STIs like chlamydia and gonorrhea; Post-Exposure Prophylaxis (PEP) for HIV prevention in higher-risk cases, which must be started within 72 hours and continued for 28 days; tetanus prophylaxis if needed; and possibly anti-anxiety medication. These medications each have their own potential side effects, which your healthcare provider should explain. You always have the right to understand what medications are being offered, why they're recommended, and to decline any treatment. Your medical team should discuss how these medications might interact with any medications you currently take and address any concerns you have.",
        "After sexual assault, several preventive medications may be offered: Emergency contraception (EC pills like I-Pill) that can prevent pregnancy if taken within 72-120 hours of the assault; antibiotics to prevent common bacterial STIs; Post-Exposure Prophylaxis (PEP) for HIV prevention in cases with risk factors, which needs to be started within 72 hours and continued for 28 days; tetanus prophylaxis if you have wounds; and sometimes medications for anxiety or sleep difficulties. Each medication has potential side effects ranging from mild (nausea, headache) to more significant, which should be explained to you. You have the absolute right to make informed decisions about these medications - healthcare providers should explain each one's purpose, effectiveness, side effects, and answer all your questions before you decide."
      ]
    },
    {
      "tag": "legal_rights_india",
      "patterns": [
        "What does Indian law say about rape?",
        "What are the punishments for sexual offenders in India?",
        "Tell me about the POCSO Act",
        "What legal protections do minors have in India?",
        "What is Section 375 of IPC?",
        "How does the Criminal Law Amendment Act protect victims?",
        "What compensation can I get as a sexual assault victim in India?",
        "What are my legal rights during a rape trial in India?",
        "How has rape law changed in India recently?",
        "What is the punishment for rape in India?",
        "What happens in Indian courts for sexual assault cases?",
        "Are there special courts for rape cases in India?",
        "What is the definition of rape under Indian law?",
        "Does Indian law recognize marital rape?",
        "What legal aid is available for rape victims in India?"
      ],
      "responses": [
        "In India, sexual offenses are primarily covered under the Indian Penal Code (IPC) and special legislation. The key provisions include: Section 375 and 376 of IPC define and punish rape with imprisonment ranging from 7 years to life, and potentially death penalty in especially brutal cases. Section 354 covers assault or criminal force against women. For children, the Protection of Children from Sexual Offences (POCSO) Act, 2012 provides comprehensive protection with stricter punishments. The Criminal Law Amendment Act, 2013 expanded the definition of sexual offenses and increased penalties. Under Section 357A of the Criminal Procedure Code, state governments must establish victim compensation schemes. Your legal rights include: identity protection (Section 228A of IPC), in-camera trials, free legal aid, medical examination only with consent, and compensation. For specific legal assistance, contact the National Legal Services Authority (NALSA) at 1516.",
        "Indian law has strong provisions against sexual offenses. The Indian Penal Code (IPC) Section 375 defines rape comprehensively, covering various non-consensual sexual acts, while Section 376 prescribes punishment ranging from 7 years to life imprisonment, with death penalty in the rarest of rare cases. For minors, the POCSO Act of 2012 provides special protections with strict punishments, mandatory reporting, special courts, and child-friendly procedures. Recent amendments, particularly after the 2012 Delhi case, have strengthened these laws. The Criminal Law Amendment Act, 2013 broadened the definition of sexual offenses and increased penalties. You have rights to: confidentiality (your identity cannot be disclosed under Section 228A), private court proceedings, free legal representation, and compensation through victim compensation schemes. For specialized legal assistance, contact the National Commission for Women helpline at 1516 or 7827170170.",
        "Indian law provides comprehensive protection against sexual offenses through several legal provisions: The Indian Penal Code Section 375 defines rape, while Section 376 prescribes punishment ranging from 7 years to life imprisonment, and potentially death penalty in aggravated cases. For minors (under 18), the Protection of Children from Sexual Offences (POCSO) Act provides special protections including: strict punishments, dedicated special courts, child-friendly procedures, and mandatory reporting. Following the 2012 Delhi case, significant legal reforms were implemented through the Criminal Law Amendment Act, 2013, which expanded the definition of sexual offenses and increased penalties. Your legal rights include: confidentiality (Section 228A protects your identity), in-camera trials, free legal aid under the Legal Services Authorities Act, medical examination only with consent, and state compensation under victim compensation schemes. For legal assistance, you can contact NALSA (National Legal Services Authority) at 1516."
      ]
    },
    {
      "tag": "help_for_minors",
      "patterns": [
        "I'm under 18 and was assaulted, what special help can I get?",
        "My daughter is 15 and was abused, what should we do?",
        "Are there special protections for children who are assaulted?",
        "How does reporting work for minors who were abused?",
        "My sister is 14 and told me she was raped, how do I help her?",
        "What happens when a child reports sexual abuse in India?",
        "Can a minor get medical help for assault without parents knowing?",
        "What is different about medical care for assaulted teenagers?",
        "My child was abused, what special rights do they have?",
        "How does the POCSO Act help abused children?",
        "I'm 16 and was assaulted, do I need my parents involved?",
        "Are there special counseling services for minors after assault?",
        "What medical exams are done for children after sexual abuse?",
        "Will police involve my parents if I report assault as a minor?",
        "What happens when children testify about sexual abuse?"
      ],
      "responses": [
        "For minors (under 18) who experience sexual assault, India has special protections under the Protection of Children from Sexual Offences (POCSO) Act. Medical care should be provided in a child-friendly manner, with the presence of a parent/guardian or person the child trusts. Under POCSO, reporting is mandatory - medical professionals, teachers, and others who know about the abuse must report it to authorities. Special procedures include: statement recording by female officers in child-friendly settings, special courts for expedited trials, victim compensation, and medical examination only with consent of parent/guardian. Childline (1098) provides specialized support for minors. The law has strict punishments for offenders against minors. While parental involvement is typically required for medical and legal procedures, the child's comfort and best interests should be the priority throughout the process.",
        "India has specialized protections for minors (under 18) who experience sexual assault through the POCSO Act (Protection of Children from Sexual Offences Act). This law mandates child-friendly procedures including: statement recording in comfortable settings by specially trained officers, medical examination in the presence of parents/guardians or persons the child trusts, special courts for faster trials, and strict punishments for offenders. For medical care, parental/guardian consent is typically required, though emergency treatment can be provided. Unlike adult cases, all sexual offenses against minors must be reported to authorities under mandatory reporting provisions. Childline (1098) provides specialized 24/7 support for minors. Throughout legal and medical processes, the child's comfort and protection are prioritized, with options for in-camera proceedings and identity protection.",
        "For minors who experience sexual assault, India provides enhanced protections through the POCSO Act (Protection of Children from Sexual Offences Act). Medical care, legal procedures, and support services are all adapted to be child-friendly. Key provisions include: medical examination conducted sensitively with parent/guardian consent (except in emergencies), statement recording by specially trained officers in comfortable settings, mandatory reporting of all cases to authorities, special courts for faster trials, strict confidentiality of the child's identity, and enhanced punishment for offenders. Childline (1098) offers specialized 24/7 support for minors. While parental/guardian involvement is typically necessary for both medical and legal processes, exceptions may be considered if parents are unavailable or if parental involvement would not serve the child's best interests. Throughout all procedures, the child's psychological comfort and protection from further trauma are prioritized."
      ]
    },
    {
      "tag": "suicide_thoughts",
      "patterns": [
        "I feel like ending my life after being assaulted",
        "I'm having suicidal thoughts since the rape",
        "I can't go on after what happened to me",
        "I don't want to live with this trauma anymore",
        "I'm thinking of killing myself after the abuse",
        "My friend was assaulted and is talking about suicide",
        "Life doesn't seem worth living after what happened",
        "How to cope with suicidal feelings after assault",
        "I can't see a future for myself after being raped",
        "I wish I wasn't alive after the sexual abuse",
        "Nothing matters anymore since I was assaulted",
        "I feel hopeless and suicidal after what happened",
        "The pain is too much, I want to end it all",
        "I'm planning to kill myself because of the assault",
        "How do I stop wanting to die after being raped?"
      ],
      "responses": [
        "I'm deeply concerned about your safety right now. Please know that while these feelings are a response to extreme trauma, they can be addressed with proper support. Please call India's suicide prevention helpline immediately at 9152987821 (AASRA) or 1800-599-0019 (National Mental Health helpline). These services provide confidential support 24/7. If you're in immediate danger, please go to the nearest emergency room or call emergency services. Trauma can cause overwhelming feelings, but with professional help, these feelings can diminish over time. Many survivors have found that with appropriate treatment, the pain becomes manageable and hope returns. Please reach out for professional help right away - you deserve support during this difficult time.",
        "Your safety is the absolute priority right now. Please contact India's suicide prevention helpline immediately at 9152987821 (AASRA) or 1800-599-0019 (National Mental Health helpline) - they provide confidential support 24/7 and understand trauma-related suicidal thoughts. If you're in immediate danger, please go to your nearest emergency department or call emergency services. Suicidal thoughts after sexual assault are a response to extreme trauma, not a reflection of your worth or future possibilities. With proper trauma-informed treatment, including approaches specifically designed for sexual assault survivors, many people find that these overwhelming feelings become manageable. Please tell someone you trust about these thoughts and seek professional help immediately - effective treatments exist, and recovery is possible.",
        "I'm extremely concerned about your wellbeing. Please call India's suicide prevention helpline right now at 9152987821 (AASRA) or 1800-599-0019 (National Mental Health helpline). If you're in immediate danger, please go to the nearest emergency room or call emergency services. Suicidal thoughts after sexual assault are a response to overwhelming trauma - they are not a permanent state, though they feel unbearable right now. Many survivors have experienced similar feelings and have found that with professional trauma treatment, these thoughts diminish and hope returns. Specialized trauma therapy can help process these painful feelings and develop coping strategies. Your life has value beyond this terrible experience. Please reach out for professional help immediately - you deserve support and there are people who want to help you through this."
      ]
    },
    {
      "tag": "follow_up_medical_care",
      "patterns": [
        "What follow-up medical care do I need after sexual assault?",
        "How long should I get medical checkups after being raped?",
        "What ongoing health issues should I watch for after assault?",
        "When should I get tested for STDs again after assault?",
        "Do I need follow-up appointments after initial rape exam?",
        "My assault was months ago, do I still need medical care?",
        "What long-term health effects can sexual assault have?",
        "When should I return to the doctor after assault examination?",
        "What timeline for medical care should I follow after assault?",
        "How do I know if I'm healing properly after sexual assault?",
        "What symptoms should concern me after being assaulted?",
        "Do I need to keep seeing a doctor after initial assault care?",
        "What ongoing medical tests do sexual assault survivors need?",
        "How often should I get STI testing after assault?",
        "What follow-up care is recommended for rape survivors?"
      ],
      "responses": [
        "Follow-up medical care after sexual assault is important for your health. A recommended timeline includes: 1) A follow-up visit 1-2 weeks after initial care to check healing of any injuries and review test results. 2) STI testing at intervals (typically 2 weeks, 6 weeks, 3 months, and sometimes 6 months) as different infections have different window periods for detection. 3) Pregnancy testing if relevant and not using emergency contraception. 4) Mental health assessment, as physical and emotional health are connected. Watch for symptoms needing prompt attention: unusual discharge, pelvic pain, fever, worsening pain, or changes in bleeding patterns. If you received Post-Exposure Prophylaxis (PEP) for HIV prevention, follow-up is essential to monitor for side effects and ensure completion of the 28-day regimen. Always feel empowered to ask your healthcare provider about any concerns or symptoms.",
        "Follow-up care after sexual assault helps ensure complete physical recovery and addresses potential delayed health concerns. A typical follow-up schedule includes: an initial follow-up within 1-2 weeks to check healing and early test results; STI testing at recommended intervals (usually 2 weeks, 6 weeks, 3 months, and sometimes 6 months) since different infections become detectable at different times; pregnancy testing if applicable; and assessment of any ongoing pain, urinary symptoms, or gynecological issues. Additionally, healthcare providers should inquire about mental health symptoms that can affect physical health, such as sleep disturbances or appetite changes. If you received preventive medications (particularly HIV PEP which requires 28 days of treatment), follow-up ensures proper completion and monitoring for side effects. Keep a record of any symptoms between appointments, and don't hesitate to seek care for concerning symptoms like fever, increasing pain, or unusual discharge.",
        "Proper follow-up care is an important part of recovery after sexual assault. Recommended follow-up typically includes: a visit within 1-2 weeks to assess healing and review initial test results; serial STI testing at appropriate intervals (usually at 2 weeks, 6 weeks, 3 months, and sometimes 6 months depending on exposure risks); pregnancy testing if relevant; and monitoring of any gynecological symptoms. If you received preventive medications, particularly the 28-day HIV Post-Exposure Prophylaxis (PEP), follow-up ensures proper completion and monitors for side effects. Physical symptoms requiring prompt attention include: unusual vaginal/rectal discharge, persistent or worsening pain, fever, bleeding irregularities, or urinary symptoms. Many healthcare facilities have sexual assault follow-up protocols, but you can always advocate for the care you need. Remember that physical and emotional healing are connected, so mental health support is also an important aspect of follow-up care."
      ]
    },
    {
      "tag": "conclusion_legal_advice",
      "patterns": [
        "What are my legal rights after assault?",
        "Legal options for rape survivors in India",
        "Important laws about sexual assault",
        "Legal support for sexual violence victims",
        "What legal protections do assault survivors have?",
        "Indian laws about sexual violence",
        "Legal action for sexual assault victims",
        "Recent changes to rape laws in India",
        "What legal steps can I take after assault?",
        "Rights of sexual assault survivors in court",
        "Legal proceedings for rape cases",
        "Special legal provisions for assault victims",
        "Compensation for sexual assault victims",
        "Legal timeframe for reporting sexual assault",
        "How do rape trials work in India?"
      ],
      "responses": [
        "Under Indian law, sexual assault survivors have several important legal rights. The Indian Penal Code (IPC) Sections 375, 376, 354, and 509 cover various sexual offenses, with punishments ranging from 7 years to life imprisonment depending on circumstances. For minors, the POCSO Act provides enhanced protections. Your specific legal rights include: confidentiality (Section 228A of IPC prohibits disclosing a victim's identity), in-camera trials (private court proceedings), statement recording by female officers in a private setting, free legal aid under the Legal Services Authorities Act, medical examination only with consent (Section 164A CrPC), and compensation through victim compensation schemes established under Section 357A CrPC. There is no time limitation for reporting sexual offenses in India. For specialized legal assistance, contact the National Commission for Women at 1516 or 7827170170, or District Legal Services Authority in your area.",
        "Sexual assault survivors in India are protected by comprehensive legal provisions. The Indian Penal Code defines and penalizes sexual offenses through Sections 375 (definition of rape), 376 (punishment for rape), 354 (assault to outrage modesty), and 509 (insulting the modesty of women). For children under 18, the POCSO Act of 2012 provides special protections including stricter punishments and child-friendly procedures. Following the Criminal Law Amendment Act of 2013, the definition of sexual offenses was expanded and penalties increased. Your rights throughout the legal process include: protection of identity (Section 228A), private court proceedings, female officer recording your statement, free legal representation, medical examination only with consent, and eligibility for compensation through state victim compensation schemes. For legal guidance, you can contact the National Legal Services Authority (NALSA) at 1516 or approach your District Legal Services Authority.",
        "In India, sexual assault survivors have significant legal protections under both the Indian Penal Code and special legislation. The law recognizes various forms of sexual violence under IPC Sections 375 (rape), 376 (punishment for rape), 354 (assault or criminal force against women), and 509 (word, gesture or act intended to insult modesty). For minors, the POCSO Act provides enhanced protections. The Criminal Law Amendment Acts of 2013 and 2018 strengthened these provisions following the 2012 Delhi case. Your specific rights include: confidentiality protection (Section 228A prohibits revealing a victim's identity), in-camera trials, female officer recording your statement in privacy, free legal aid, medical examination only with consent, and compensation through state victim compensation schemes. There is no statute of limitations for reporting sexual offenses in India. For specialized legal support, contact the National Commission for Women at 1516 or your local District Legal Services Authority."
      ]
    },
    {
      "tag": "wife_seeking_help",
      "patterns": [
        "My husband abuses me daily, I don't know what to do.",
        "I am facing domestic violence from my husband, please help me.",
        "My husband shouts at me and hits me, I feel helpless.",
        "What can I do if my husband is physically abusing me?",
        "My husband insults and hurts me all the time, how can I get help?",
        "My husband beats me and threatens to harm me, what should I do?",
        "I am scared of my husband's violent behavior. Where can I get support?",
        "Every day, my husband harasses me. Can I take legal action?",
        "My husband controls me and doesnt allow me to speak, is this abuse?",
        "I need help! My husband is aggressive and hurts me frequently.",
        "How can I protect myself from my abusive husband legally?",
        "My husband mentally tortures me and sometimes gets physical. What are my rights?",
        "I have no financial independence, and my husband abuses me. What can I do?",
        "My husband drinks and then beats me, I fear for my safety.",
        "What legal rights do I have as a wife against domestic violence?"
      ],
      "responses": [
        "I'm so sorry you're going through this. You are not alone, and there are legal protections available. You can file a complaint under the **Protection of Women from Domestic Violence Act, 2005** and seek protection under **IPC Section 498A**.",
        "That sounds very painful and unfair. You deserve safety and respect. Please consider approaching the nearest police station or a women's helpline. Under **IPC 498A**, cruelty by a husband is a punishable offense.",
        "No one deserves to be treated this way. You have legal rights under the **Domestic Violence Act, 2005**. You can approach a lawyer, file a complaint, or seek immediate protection through **Section 125 CrPC** for maintenance and support."
      ]
    },
    {
      "tag": "wife_sharing_experience",
      "patterns": [
        "I have suffered years of abuse from my husband, and I want justice.",
        "My husband used to be kind but now abuses me daily.",
        "I tried to adjust, but my husband's violence has increased over time.",
        "I stayed silent for years, but my husband keeps hurting me emotionally and physically.",
        "Even after trying everything, my husband still abuses me. I feel trapped.",
        "I tolerated my husband's abusive behavior for the sake of my children, but it's getting worse.",
        "Whenever I speak up, my husband threatens me. I don't know what to do.",
        "My husband treats me like I am nothing. He yells and even gets violent.",
        "I want to take legal action against my husband for domestic violence.",
        "I filed a complaint before, but my husband keeps threatening me.",
        "My husband never lets me go outside, he isolates me and abuses me at home.",
        "Whenever I ask for financial support, my husband gets violent.",
        "I am being mentally tortured by my husband, and I dont know how to escape.",
        "My husband and his family keep harassing me, even after I warned them.",
        "I feel unsafe in my own home because of my husband's aggressive behavior."
      ],
      "responses": [
        "I'm truly sorry you had to endure this. You have legal options under **IPC Section 498A** and the **Domestic Violence Act, 2005**. You can file a complaint, seek a restraining order, and claim maintenance under **Section 125 CrPC**.",
        "No one deserves to suffer in silence. You have the right to protection under the **Indian Constitution, Article 21 (Right to Life and Personal Liberty)**. Please seek help from legal authorities or NGOs supporting domestic violence survivors.",
        "Your safety is the priority. You can approach the police, a protection officer, or a womens helpline. You are protected under **IPC 498A and Section 3 of the Domestic Violence Act, 2005**."
      ]
    },
    {
      "tag": "wife_seeking_acknowledgment",
      "patterns": [
        "Is it wrong that my husband beats me?",
        "Should I tolerate my husband's anger and abuse?",
        "Am I overreacting if I feel unsafe at home?",
        "I feel like I am the only one suffering, does anyone understand me?",
        "Is my husband's controlling behavior considered abuse?",
        "My husband keeps blaming me for everything, is that normal?",
        "I feel emotionally exhausted by my husband's abuse, is this valid?",
        "If my husband forces me to obey, is that legal?",
        "Is verbal abuse also considered domestic violence?",
        "Am I weak for not leaving my abusive husband?",
        "Is it okay for my husband to punish me if I make a mistake?",
        "I cry every night because of my husbands words, is that abuse?",
        "If my husband denies me food and money, is that a crime?",
        "My husband disrespects and humiliates me in public, is this abuse?",
        "If my husband threatens me, should I be worried?"
      ],
      "responses": [
        "You are not alone. Any form of abusephysical, emotional, financial, or verbalis unacceptable and punishable under **IPC Section 498A and the Domestic Violence Act, 2005**.",
        "Your feelings are completely valid. You deserve respect and safety. Indian law protects women from all forms of domestic abuse under **Section 3 of the Domestic Violence Act, 2005**.",
        "Abuse is never justified. You have the right to live with dignity under **Article 21 of the Indian Constitution**. Please seek help and support."
      ]
    },
    {
      "tag": "wife_seeking_legal_advice",
      "patterns": [
        "What should I do if my husband is abusing me?",
        "How can I file a case against my husband for domestic violence?",
        "Which law protects wives from domestic abuse in India?",
        "Can I get a restraining order against my husband?",
        "What are my rights if my husband abuses me physically and emotionally?"
      ],
      "responses": [
        "You can file a complaint under **IPC 498A** for cruelty, seek protection under the **Domestic Violence Act, 2005**, and apply for maintenance under **Section 125 CrPC**. Contact a lawyer or a womens helpline for immediate assistance.",
        "Under **Article 21 of the Indian Constitution**, you have the right to live with dignity. You can approach the police, file an FIR under **IPC Section 498A**, and seek a restraining order through a court.",
        "Domestic violence is punishable under **IPC Section 498A**. You can file a case at the police station, get legal aid, and seek support from NGOs like the **National Commission for Women (NCW)**."
      ]
    },
    {
      "tag": "sexual_harassment",
      "patterns": [
        "My boss has been making inappropriate comments about my body.",
        "I'm uncomfortable because my colleague keeps touching me unnecessarily.",
        "My manager sent me explicit messages. What should I do?",
        "A senior keeps asking me personal and uncomfortable questions about my marriage.",
        "My wife is being harassed by her supervisor at work. Can I report this?",
        "Someone in my team is spreading false rumors about my relationship with a colleague.",
        "I was promised a promotion in exchange for inappropriate favors. Is this legal?",
        "My boss keeps making suggestive remarks and says it's just a joke.",
        "My husband is being blackmailed by his manager with personal photos. What can he do?",
        "My HR ignored my complaint about sexual harassment. What are my legal rights?",
        "A coworker has been staring at me in a way that makes me uncomfortable.",
        "I have witnessed my friend being harassed by a team lead. Should I intervene?",
        "Can I file a complaint against my boss for making sexually offensive jokes?",
        "A colleague keeps texting my wife outside of work hours. Can she report this?",
        "My supervisor is treating me unfairly because I rejected his advances."
      ],
      "responses": [
        "Sexual harassment at the workplace is a serious offense under the Sexual Harassment of Women at Workplace Act, 2013. You can file a complaint with the Internal Complaints Committee (ICC) in your company. If no action is taken, you can approach the police under Section 354A of the IPC.",
        "You have the right to work in a safe and respectful environment. Report the issue to HR or the Internal Complaints Committee. If you face retaliation, legal action can be taken under the IPC Section 509.",
        "Under Article 21 of the Indian Constitution, every person has the right to dignity and safety. Report the harassment to the appropriate authorities within your organization. If needed, file an FIR under IPC Sections 354A and 506 for protection."
      ]
    },
    {
      "tag": "blackmail",
      "patterns": [
        "My boss is threatening to fire me if I don't obey his personal demands.",
        "A colleague has personal information about my wife and is blackmailing me.",
        "I am being forced to stay silent about workplace harassment under threat.",
        "My manager is demanding money from me by threatening to reveal false information.",
        "Someone is using my private chats to manipulate me at work.",
        "A coworker is forcing me to resign by using fake allegations against me.",
        "I received an anonymous message threatening to ruin my career if I report misconduct.",
        "My employer has told me that if I don't comply, my past records will be leaked.",
        "A senior executive is trying to use blackmail to make me do unethical tasks.",
        "A colleague is threatening to expose my personal details to my wife to harm my marriage.",
        "My friend is being blackmailed by his boss. What legal action can he take?",
        "A manager keeps reminding me of a past mistake and forcing me to follow unfair rules.",
        "I am getting threats of defamation if I report my superior for illegal activities.",
        "I refused to follow an unethical order, and now I am being blackmailed at work.",
        "My HR is using personal details from my background check to control me."
      ],
      "responses": [
        "Blackmail is a criminal offense under IPC Section 384. Collect evidence and file a police complaint immediately. You also have the right to report workplace harassment to the Labor Commissioner.",
        "Under IPC Section 503, criminal intimidation is punishable by law. If you or your spouse are being blackmailed, do not comply with their demandsreport it to the authorities.",
        "If someone is threatening you with personal or professional consequences, record the evidence and report it. The law protects you under IPC Sections 384 and 506 against coercion and threats."
      ]
    },
    {
      "tag": "verbal_abuse",
      "patterns": [
        "My boss constantly insults me in front of others.",
        "A senior is using abusive language towards me and my wife.",
        "My colleague calls me derogatory names and makes fun of my appearance.",
        "I am being mentally harassed with verbal abuse daily at my workplace.",
        "My manager humiliates me during meetings and belittles my work.",
        "A coworker keeps shouting at me without any reason.",
        "I have been insulted for my caste and background at my workplace.",
        "My supervisor is mocking my wife's profession. Can I take legal action?",
        "My team lead keeps using offensive words when talking to me.",
        "I am being called disrespectful names at work for no reason.",
        "My friend is facing workplace insults from his boss every day.",
        "I am getting constant verbal abuse from my senior. Can I report it?",
        "Someone keeps making racial slurs against my wife in my office.",
        "My HR refuses to act on my complaint about verbal harassment.",
        "A manager is using threatening language to scare employees into submission."
      ],
      "responses": [
        "Verbal abuse and insults in the workplace can be reported under IPC Section 504, which criminalizes intentional insult with intent to provoke breach of peace. File a complaint with HR and escalate it if necessary.",
        "No employee should tolerate verbal abuse. Workplace harassment laws, including IPC Section 506, protect you against threats. Collect proof and take legal action if needed.",
        "If you are facing workplace insults and abuse, report the issue through internal grievance channels. If it continues, take legal action under IPC Section 509 for insulting the modesty of any person."
      ]
    },
    {
      "tag": "legal_help",
      "patterns": [
        "How can I legally report workplace harassment in India?",
        "What steps should I take if my employer ignores my complaint?",
        "Can my wife file a case against her manager for harassment?",
        "How do I file a sexual harassment complaint at work?",
        "What is the process to escalate a complaint if HR does not act?",
        "Where can I report workplace blackmail legally?",
        "Which IPC sections apply to workplace abuse?",
        "What should I do if my job is threatened for reporting misconduct?",
        "Can I get legal protection if I report harassment?",
        "What are my rights if I am forced to resign under pressure?",
        "How does the Indian Constitution protect employees from abuse?",
        "Where can I find free legal help for workplace harassment?",
        "What actions can I take if I am blackmailed at work?",
        "Can my husband file a complaint against his female boss for harassment?",
        "What should my wife do if she faces workplace insults daily?"
      ],
      "responses": [
        "Workplace harassment is punishable under IPC Sections 354A (sexual harassment), 503 (criminal intimidation), and 509 (insult to modesty). You can report it to HR, the Internal Complaints Committee, or file a police complaint.",
        "If your complaint is ignored, escalate it to the Labor Commissioner or the National Commission for Women. Article 21 of the Indian Constitution ensures your right to dignity and safety.",
        "You can seek legal protection under IPC Sections 384 (blackmail), 506 (criminal intimidation), and 504 (intentional insult). If you're facing threats, contact the police immediately."
      ]
    }
  ]
}