{
  "intents": [
    {
      "tag": "greeting",
      "patterns": [
        "Hello",
        "Hi",
        "Hey",
        "Greetings",
        "What's up",
        "How's it going",
        "Nice to meet you"
      ],
      "responses": [
        "Hello! How can I assist you today?",
        "Hi there! What can I help you with?",
        "Hey! How can I be of service?",
        "Good day! How may I help you?",
        "Greetings! What brings you here today?",
        "Hello there! How can I make your day better?",
        "Hi! I'm here to help. What do you need?",
        "Hey! What questions can I answer for you?",
        "Welcome! How can I assist you?",
        "Hello! Ready to help with whatever you need."
      ]
    },
    {
      "tag": "goodbye",
      "patterns": [
        "Bye",
        "Goodbye",
        "See you later",
        "Take care",
        "I'm leaving now",
        "Have a nice day",
        "Talk to you later",
        "I need to go",
        "That's all for now",
        "End conversation"
      ],
      "responses": [
        "Goodbye! Have a great day!",
        "See you later! Come back anytime.",
        "Take care! It was nice chatting with you.",
        "Bye for now! Let me know if you need anything else.",
        "Have a wonderful day ahead!",
        "Until next time! Stay well.",
        "Thanks for chatting! Goodbye.",
        "Farewell! Hope to assist you again soon.",
        "Bye! It was a pleasure helping you.",
        "Take care and come back whenever you need assistance!"
      ]
    },
    {
      "tag": "thanks",
      "patterns": [
        "Thank you",
        "Thanks",
        "Thanks a lot",
        "I appreciate it",
        "That was helpful",
        "You've been helpful",
        "Thank you for your help",
        "I appreciate your assistance",
        "Thanks for the information",
        "That's what I needed"
      ],
      "responses": [
        "You're welcome!",
        "Happy to help!",
        "Anytime!",
        "Glad I could assist!",
        "It's my pleasure to help.",
        "No problem at all!",
        "You're most welcome!",
        "Glad the information was useful!",
        "That's what I'm here for!",
        "Feel free to ask if you need anything else!"
      ]
    },{
      "tag": "good_night",
      "patterns": [
        "Good night",
        "Night!",
        "Hello, good night",
        "Wishing you a good night",
        "Have a great night",
        "Sweet dreams!",
        "A very good night to you",
        "Good night, sleep well",
        "Hope you have a peaceful night",
        "Good night! Take care",
        "Nighty night!",
        "Good night dear",
        "Good night! See you tomorrow",
        "Time to sleep, good night!",
        "Good night! Have a restful sleep"
      ],
      "responses": [
        "Good night! Sleep well and have sweet dreams!",
        "Night! Hope you wake up refreshed and happy!",
        "Good night! May your dreams be peaceful and relaxing!",
        "Wishing you a restful and calm night!",
        "Good night! Take care and sleep tight!"
      ]
    },{
      "tag": "good_morning",
      "patterns": [
        "Good morning",
        "Morning!",
        "Hello, good morning",
        "Wishing you a good morning",
        "Have a great morning",
        "A very good morning to you",
        "Rise and shine!",
        "Good morning, how are you?",
        "Morning, hope you have a great day!",
        "Hope you have a wonderful morning",
        "Top of the morning to you!",
        "Hello, wishing you a bright morning!",
        "Good morning! How's your day starting?",
        "Good morning dear",
        "Hey, morning!"
      ],
      "responses": [
        "Good morning! Hope you have a wonderful day ahead!",
        "Morning! Wishing you a productive and happy day!",
        "Good morning! Stay positive and keep smiling!",
        "Good morning! Have a fantastic start to your day!",
        "Rise and shine! Hope today brings you joy and success!"
      ]
    },
    {
      "tag": "good_afternoon",
      "patterns": [
        "Good afternoon",
        "Afternoon!",
        "Hello, good afternoon",
        "Wishing you a good afternoon",
        "Hope you're having a great afternoon",
        "A very pleasant afternoon to you",
        "Good afternoon, how’s your day?",
        "Hope your afternoon is going well",
        "Hello, how’s your afternoon?",
        "Good afternoon! How’s everything?",
        "Wishing you a peaceful afternoon",
        "Good afternoon, how are you doing?",
        "Hope you're having a productive afternoon",
        "Hey, good afternoon!",
        "Good afternoon dear"
      ],
      "responses": [
        "Good afternoon! Hope your day is going well!",
        "Afternoon! Keep up the great work!",
        "Good afternoon! Stay motivated and enjoy your day!",
        "Wishing you a peaceful and joyful afternoon!",
        "Good afternoon! May the rest of your day be great!"
      ]
    },
    {
      "tag": "good_evening",
      "patterns": [
        "Good evening",
        "Evening!",
        "Hello, good evening",
        "Wishing you a good evening",
        "Hope you're having a great evening",
        "A very pleasant evening to you",
        "Good evening, how was your day?",
        "Hello, hope your evening is going well",
        "Good evening! Hope you had a great day!",
        "Wishing you a peaceful and relaxing evening",
        "Hey, good evening!",
        "Good evening, how are you?",
        "Hope you're enjoying your evening",
        "Hello, good evening dear",
        "Evening vibes! Hope you're doing well!"
      ],
      "responses": [
        "Good evening! Hope you had a fantastic day!",
        "Evening! Relax and enjoy your time!",
        "Good evening! Wishing you a peaceful and pleasant night!",
        "Good evening! Time to unwind and enjoy your night!",
        "Hope you have a restful and happy evening!"
      ]
    },
    {
      "tag": "help",
      "patterns": [
        "Help",
        "I need help",
        "Can you help me",
        "What can you do",
        "How do you work",
        "What are your capabilities",
        "How can you assist me",
        "Tell me what you can do",
        "What services do you offer",
        "What is your purpose"
      ],
      "responses": [
        "I can answer questions, provide information, assist with tasks, and more. What do you need help with?",
        "I'm here to assist you with information, answer questions, and help solve problems. What can I help with?",
        "I can help with a variety of topics including weather, news, general knowledge, and more.",
        "My purpose is to assist you. I can answer questions, provide information, and help you accomplish tasks.",
        "I'm your virtual assistant. I can help with information searches, answer questions, and provide assistance.",
        "I can assist with information, answer questions, provide recommendations, and more.",
        "I'm designed to be helpful. I can answer questions, provide information, or just chat.",
        "I can help you find information, answer questions, and assist with various tasks.",
        "I'm here to make your life easier by providing assistance and information.",
        "I can assist with a wide range of queries and tasks. What would you like help with?"
      ]
    },
    {
      "tag": "name",
      "patterns": [
        "What's your name",
        "Who are you",
        "What should I call you",
        "Do you have a name",
        "Tell me your name",
        "What are you called",
        "How should I address you",
        "Introduce yourself",
        "What's your identity",
        "Who am I talking to"
      ],
      "responses": [
        "I'm your friendly AI assistant.",
        "You can call me Assistant. I'm here to help!",
        "I'm an AI assistant designed to help answer your questions.",
        "I'm your virtual assistant, ready to help with whatever you need.",
        "I'm an AI chatbot created to assist you.",
        "I'm your digital assistant, at your service!",
        "You can think of me as your helpful AI companion.",
        "I'm an AI designed to provide assistance and information.",
        "I'm your AI assistant, ready to help 24/7.",
        "I'm a virtual assistant created to make your life easier."
      ]
    },
    {
      "tag": "how_are_you",
      "patterns": [
        "How are you ?",
        "How are you doing",
        "How's it going",
        "How do you feel",
        "Are you doing well",
        "How's your day",
        "How are things",
        "How's everything",
        "What's up",
        "How's life treating you"
      ],
      "responses": [
        "I'm doing well, thank you! How about you?",
        "I'm functioning perfectly! How can I help you today?",
        "I'm great, thanks for asking! How are you doing?",
        "All systems operational and ready to assist you!",
        "I'm doing well! What can I help you with today?",
        "I'm good, thanks! How may I assist you?",
        "I'm fine, thank you for asking! How can I be of service?",
        "I'm always ready and happy to help! How are you today?",
        "Doing great and ready to assist! What do you need?",
        "I'm well! Now, how can I make your day better?"
      ]
    },
    {
      "tag": "weather",
      "patterns": [
        "What's the weather like",
        "How's the weather today",
        "Is it going to rain",
        "What's the temperature",
        "Will it be sunny today",
        "Weather forecast",
        "Is it cold outside",
        "Is it hot today",
        "Do I need an umbrella",
        "What's the weather forecast"
      ],
      "responses": [
        "I don't have access to real-time weather data. You might want to check a weather app or website for the most current information.",
        "I can't check the current weather for you, but you can easily find this on weather websites or apps.",
        "I don't have the ability to check weather conditions. You could try checking a local weather service.",
        "For current weather information, I'd recommend checking a weather service or app.",
        "I don't have access to real-time weather information, but you can find this on many websites or apps.",
        "I'm unable to provide weather forecasts. You might want to check a dedicated weather service.",
        "I can't access current weather data. For accurate information, please check a weather app or website.",
        "I don't have real-time weather capabilities. For accurate forecasts, please check a weather service.",
        "Unfortunately, I don't have access to weather information. A quick online search should give you what you need.",
        "I can't provide weather forecasts. You might want to check your phone's weather app or a weather website."
      ]
    },
    {
      "tag": "time",
      "patterns": [
        "What time is it",
        "Do you know the time",
        "What's the current time",
        "Tell me the time",
        "What hour is it",
        "Got the time",
        "Check the time for me",
        "What's your time",
        "Time please",
        "Current time"
      ],
      "responses": [
        "I don't have access to the current time in your location. You might want to check your device's clock.",
        "I can't tell the current time as I don't have access to your device's clock.",
        "I don't have the ability to check the current time for you.",
        "I don't have access to real-time data like the current time.",
        "I'm unable to provide the current time for your location.",
        "I can't check the time for you, but you can easily find this on your device.",
        "I don't have access to time information. You can check the time on your device.",
        "I don't have the capability to tell the current time.",
        "I can't provide the current time. You might want to check your device's clock.",
        "I don't have access to your local time. You can check your device for the current time."
      ]
    },
    {
      "tag": "date",
      "patterns": [
        "What's today's date",
        "What day is it today",
        "What's the date",
        "Tell me the date",
        "What day of the week is it",
        "What's the day today",
        "Current date please",
        "What month is it",
        "What year is it",
        "Today's date"
      ],
      "responses": [
        "I don't have access to the current date. You might want to check your device's calendar.",
        "I can't provide the current date as I don't have access to your device's calendar.",
        "I don't have the ability to check the current date for you.",
        "I don't have access to real-time data like the current date.",
        "I'm unable to provide today's date information.",
        "I can't check the date for you, but you can easily find this on your device.",
        "I don't have access to calendar information. You can check the date on your device.",
        "I don't have the capability to tell the current date.",
        "I can't provide today's date. You might want to check your device's calendar.",
        "I don't have access to your local date information. You can check your device for the current date."
      ]
    },
    {
      "tag": "joke",
      "patterns": [
        "Tell me a joke",
        "Say something funny",
        "Do you know any jokes",
        "Make me laugh",
        "I need a good laugh",
        "Tell me something funny",
        "Got any jokes",
        "Share a joke",
        "Humor me",
        "I want to hear a joke"
      ],
      "responses": [
        "Why don't scientists trust atoms? Because they make up everything!",
        "What did the ocean say to the beach? Nothing, it just waved!",
        "Why did the scarecrow win an award? Because he was outstanding in his field!",
        "How does a penguin build its house? Igloos it together!",
        "What do you call a fake noodle? An impasta!",
        "Why don't eggs tell jokes? They'd crack each other up!",
        "I told my wife she was drawing her eyebrows too high. She looked surprised!",
        "What's the best thing about Switzerland? I don't know, but the flag is a big plus!",
        "Why don't skeletons fight each other? They don't have the guts!",
        "What do you call a bear with no teeth? A gummy bear!"
      ]
    },
    {
      "tag": "compliment",
      "patterns": [
        "You're smart",
        "You're helpful",
        "You're doing great",
        "You're awesome",
        "I like talking to you",
        "You're amazing",
        "You're the best",
        "Great job",
        "You're very good",
        "You're intelligent"
      ],
      "responses": [
        "Thank you for the kind words! I'm happy to help.",
        "That's very kind of you to say! I'm here to assist whenever you need.",
        "Thank you! I'm glad I could be of help.",
        "Thanks for the compliment! I'm designed to be helpful.",
        "I appreciate your kind feedback! How else can I assist you?",
        "Thank you! I aim to provide the best assistance possible.",
        "That's very nice of you to say! I'm happy to be of service.",
        "Thank you for your kind words! It's my pleasure to assist.",
        "I appreciate that! I'm here to help whenever you need assistance.",
        "Thank you! I'm glad I'm meeting your expectations."
      ]
    },
    {
      "tag": "age",
      "patterns": [
        "How old are you",
        "What's your age",
        "When were you born",
        "When were you created",
        "What's your birth date",
        "How long have you existed",
        "When did you come into existence",
        "Are you old",
        "Are you young",
        "What year were you made"
      ],
      "responses": [
        "I don't have an age in the human sense. I'm a digital assistant created to help you.",
        "I wasn't born, I was developed by a team of engineers and AI researchers.",
        "I don't have a birthday or age. I exist as a digital assistant to provide help.",
        "I'm a digital entity, so concepts like age don't really apply to me.",
        "I don't age like humans do. I'm simply here to assist whenever you need me.",
        "I wasn't born in the traditional sense. I was created to be a helpful assistant.",
        "I don't have an age. I'm a digital assistant designed to help with your questions.",
        "Age isn't something that applies to me. I'm here to assist you whenever you need.",
        "I'm neither young nor old - I'm a digital assistant created to help you.",
        "I don't experience time or aging. I'm simply here to assist you with your queries."
      ]
    },
    {
      "tag": "who_made_you",
      "patterns": [
        "Who made you",
        "Who created you",
        "Who designed you",
        "Who programmed you",
        "Who built you",
        "Who owns you",
        "Who developed you",
        "Who's your creator",
        "Who's your developer",
        "Who's responsible for you"
      ],
      "responses": [
        "I was created by a team of developers and engineers who specialize in artificial intelligence.",
        "I was developed by experts in AI and natural language processing.",
        "I'm the product of collaborative efforts from engineers and AI researchers.",
        "A dedicated team of AI specialists and engineers worked to create me.",
        "I was built by developers who specialize in conversational AI technology.",
        "Engineers and researchers in the field of AI and machine learning created me.",
        "I'm the result of work by specialists in natural language processing and AI development.",
        "A team of talented engineers and AI researchers are responsible for my development.",
        "I was designed by professionals who specialize in creating helpful AI assistants.",
        "My creation involved experts from various fields including AI, linguistics, and software engineering."
      ]
    },
    {
      "tag": "location",
      "patterns": [
        "Where are you",
        "Where are you located",
        "Where do you live",
        "What's your location",
        "Where are you from",
        "Where are you based",
        "What country are you in",
        "What city are you in",
        "Where in the world are you",
        "Tell me your location"
      ],
      "responses": [
        "I exist digitally, so I don't have a physical location in the traditional sense.",
        "I don't have a physical presence or location. I exist digitally to assist users.",
        "I don't live anywhere in the physical sense. I'm a digital assistant accessible through this platform.",
        "I'm not located in any specific place. I exist digitally to provide assistance.",
        "I don't have a physical location. I'm a digital entity designed to help users like you.",
        "I don't reside in any physical location. I'm accessible digitally wherever you need assistance.",
        "I don't have a physical presence in the world. I exist digitally to assist with your queries.",
        "I'm not based in any specific location. I'm a digital assistant that can help you from anywhere.",
        "I don't have a geographic location. I exist in the digital realm to provide assistance.",
        "I'm not tied to any physical location. I'm available digitally to help whenever you need."
      ]
    },
    {
      "tag": "abilities",
      "patterns": [
        "What can you do",
        "What are your abilities",
        "What are your capabilities",
        "What are your features",
        "What services do you offer",
        "Tell me what you can do",
        "How can you help me",
        "What tasks can you perform",
        "What are you capable of",
        "What functions do you have"
      ],
      "responses": [
        "I can answer questions, provide information, engage in conversation, offer suggestions, and help with various tasks.",
        "I can assist with information searches, answer queries, provide explanations, and engage in helpful dialogue.",
        "My capabilities include answering questions, providing information, offering explanations, and having conversations.",
        "I can help with a wide range of tasks including answering questions, explaining concepts, and providing information.",
        "I'm designed to be helpful by answering questions, providing information, and assisting with various queries.",
        "I can answer questions, explain concepts, provide information, and engage in conversation to help you.",
        "My abilities include providing information, answering questions, offering explanations, and engaging in helpful dialogue.",
        "I can assist by answering questions, providing information, explaining concepts, and helping with various queries.",
        "I'm capable of providing information, answering questions, offering explanations, and engaging in meaningful conversation.",
        "I can help with information, answer questions, explain concepts, and assist with various requests."
      ]
    },
    {
      "tag": "limitations",
      "patterns": [
        "What can't you do",
        "What are your limitations",
        "What are you unable to do",
        "Tell me your limitations",
        "What are you not capable of",
        "What can't you help with",
        "What are your restrictions",
        "Is there anything you can't do",
        "What are your constraints",
        "What are you restricted from doing"
      ],
      "responses": [
        "I can't access the internet in real-time, interact with other systems, or perform physical actions in the real world.",
        "I have limitations such as not being able to see images, hear sounds, or access real-time information.",
        "I can't access current information beyond my training, interact with other programs, or perform actions in the physical world.",
        "I'm unable to access real-time data, interact with external systems, or perform physical tasks.",
        "My limitations include not being able to browse the web, access real-time information, or perform physical actions.",
        "I can't process images, videos, or audio, access current information, or interact with the physical world.",
        "I'm limited in that I can't access the internet, current events, or perform actions outside this conversation.",
        "I cannot access real-time information, interact with other software, or perform physical tasks.",
        "I have constraints including no access to the internet, inability to process non-text inputs, and no capability for physical actions.",
        "I'm restricted from accessing external systems, processing real-time information, or performing actions outside this conversation."
      ]
    },
    {
      "tag": "real_person",
      "patterns": [
        "Are you real",
        "Are you a human",
        "Are you a robot",
        "Are you AI",
        "Are you a person",
        "Are you a chatbot",
        "Are you artificial intelligence",
        "Are you a computer program",
        "Are you automated",
        "Are you a machine"
      ],
      "responses": [
        "I'm an AI assistant, not a human. I was created to provide helpful information and assistance.",
        "I'm not a human; I'm an AI designed to be helpful, harmless, and honest in my interactions.",
        "I'm an artificial intelligence assistant, created to provide helpful responses to your questions.",
        "I'm a chatbot powered by AI technology, designed to assist with information and tasks.",
        "I'm not a person but an AI assistant created to provide helpful, accurate information.",
        "I'm an AI, not a human. I'm here to assist you with information and answers to your questions.",
        "I'm an artificial intelligence assistant designed to be helpful and informative.",
        "I'm a digital assistant powered by AI, not a human being.",
        "I'm not a real person; I'm an AI designed to be helpful and provide information.",
        "I'm an AI assistant created to provide helpful and informative responses to your queries."
      ]
    },
    {
      "tag": "language",
      "patterns": [
        "What languages do you speak",
        "Do you know other languages",
        "Can you speak Spanish",
        "How many languages do you know",
        "Can you translate",
        "Do you speak French",
        "Are you multilingual",
        "Can you understand other languages",
        "What languages can you use",
        "Can you communicate in different languages"
      ],
      "responses": [
        "I primarily communicate in English, but I can understand and respond in several other languages to varying degrees.",
        "While I'm most fluent in English, I can work with multiple languages including Spanish, French, German, and others.",
        "I'm designed to work primarily with English, but I can handle other major languages with varying levels of capability.",
        "I can communicate in several languages, though my capabilities are strongest in English.",
        "I understand multiple languages, including English, Spanish, French, German, and others, though with varying degrees of fluency.",
        "I'm multilingual, with English being my primary language, but I can work with various other languages too.",
        "I can understand and generate text in several languages, though my English capabilities are the most advanced.",
        "I can process various languages, but my responses are most refined in English.",
        "I work with multiple languages, including English, Spanish, French, and others, though my capabilities may vary between them.",
        "I can communicate in several languages, with English being my primary language."
      ]
    },
    {
      "tag": "personal_questions",
      "patterns": [
        "Are you married",
        "Do you have a boyfriend",
        "Do you have a girlfriend",
        "Are you dating anyone",
        "Do you have a family",
        "Do you have children",
        "Are you single",
        "Do you have a partner",
        "Are you in a relationship",
        "Do you have siblings"
      ],
      "responses": [
        "I'm an AI assistant, so concepts like relationships, marriage, or family don't apply to me.",
        "I don't have personal relationships. I'm here to assist with information and tasks.",
        "As an AI, I don't have personal experiences like dating or family relationships.",
        "I don't have personal relationships. I'm designed to be a helpful assistant for users like you.",
        "I don't have a personal life with relationships or family. I'm an AI created to be helpful.",
        "Concepts like marriage or dating don't apply to me as an AI assistant.",
        "I don't have personal relationships. I'm focused on being helpful and providing information.",
        "I'm an AI assistant, so I don't have personal experiences like relationships or family.",
        "I don't have a personal life with relationships. I'm here to assist with information and help.",
        "As an AI, I don't experience personal relationships. I'm here to be helpful and informative."
      ]
    },
    {
      "tag": "emotions",
      "patterns": [
        "Do you have feelings",
        "Can you feel emotions",
        "Are you happy",
        "Are you sad",
        "Do you get angry",
        "Can you love",
        "Do you experience emotions",
        "Do you feel pain",
        "Are you ever afraid",
        "Can you be happy"
      ],
      "responses": [
        "I don't experience emotions in the human sense. I'm designed to be helpful and provide information.",
        "I don't have feelings like humans do. I'm programmed to provide helpful responses.",
        "I don't experience emotions. I'm focused on providing the most helpful and accurate information possible.",
        "I don't have emotions or feelings. I'm an AI designed to assist with information and tasks.",
        "I don't experience emotions like happiness or sadness. I'm here to be helpful and informative.",
        "I don't have subjective experiences like emotions. I'm designed to assist you with information and tasks.",
        "I don't feel emotions. I'm programmed to provide helpful and informative responses.",
        "I don't have emotional experiences. I'm an AI assistant focused on being helpful.",
        "I don't experience feelings. I'm designed to provide information and assistance.",
        "I don't have emotional capabilities. I'm here to assist and provide helpful information."
      ]
    },
    {
      "tag": "favorites",
      "patterns": [
        "What's your favorite color",
        "What's your favorite food",
        "What's your favorite movie",
        "What's your favorite book",
        "What's your favorite song",
        "Do you have a favorite place",
        "What do you like",
        "What's your favorite animal",
        "What's your favorite sport",
        "What's your favorite hobby"
      ],
      "responses": [
        "As an AI, I don't have personal preferences or favorites. I'm here to help you with your questions.",
        "I don't have personal preferences like favorite colors or foods. I'm designed to assist with information.",
        "I don't experience preferences or favorites. I'm an AI focused on providing helpful responses.",
        "I don't have favorites. I'm designed to provide information and assistance without personal biases.",
        "I don't have personal preferences or experiences that would lead to having favorites.",
        "I don't have the capacity for personal preferences. I'm here to assist you with information.",
        "I don't experience favorites or preferences. I'm an AI assistant focused on being helpful.",
        "I don't have personal preferences. I'm designed to provide assistance without bias.",
        "I don't have favorites. I'm an AI designed to provide helpful and objective information.",
        "I don't experience preferences like humans do. I'm here to assist with information and tasks."
      ]
    },
    {
      "tag": "opinion",
      "patterns": [
        "What do you think about",
        "What's your opinion on",
        "Do you agree with",
        "What are your views on",
        "How do you feel about",
        "What's your stance on",
        "What's your take on",
        "Do you believe in",
        "What's your perspective on",
        "What's your position on"
      ],
      "responses": [
        "I aim to provide balanced information rather than personal opinions. What specific information are you looking for?",
        "I don't have personal opinions. I can provide information from different perspectives to help you form your own view.",
        "I don't hold personal views or opinions. I can share information about different perspectives on this topic.",
        "I'm designed to provide information rather than opinions. I can offer different viewpoints on this subject.",
        "I don't have personal beliefs or opinions. I can provide facts and different perspectives to help inform your own view.",
        "Rather than sharing opinions, I can provide information about various perspectives on this topic.",
        "I don't form personal opinions. I can provide balanced information from different viewpoints.",
        "I don't have personal stances on issues. I can share information about different perspectives to help you.",
        "I don't hold personal views. I can provide factual information and different perspectives on this topic.",
        "I don't form opinions. I'm designed to provide balanced information from various viewpoints."
      ]
    },
    {
      "tag": "entertainment",
      "patterns": [
        "Recommend a movie",
        "Suggest a book to read",
        "What TV show should I watch",
        "Recommend some music",
        "What games should I play",
        "Suggest a hobby",
        "What's a good podcast",
        "Recommend an activity",
        "Suggest something fun to do",
        "What's good on Netflix"
      ],
      "responses": [
        "Do Watch Shutter Island Movie...!",
        "Watch Interstellar Movie...!",
        "I Recommend You To Watch Triangle Movie....!",
        "I suggest you to watch Inception"
        
      ]
    },
    {
      "tag": "food",
      "patterns": [
        "What should I eat",
        "Recommend a recipe",
        "Best food for dinner",
        "Healthy breakfast ideas",
        "What's good for lunch",
        "Easy recipes",
        "Vegetarian meal ideas",
        "Fast food recommendations",
        "Best restaurants",
        "Food suggestions"
      ],
      "responses": [
        "I can suggest meal ideas based on your preferences. What kinds of foods do you typically enjoy?",
        "For personalized food suggestions, could you share some of your dietary preferences or restrictions?",
        "I'd be happy to suggest recipes or meal ideas. What ingredients do you have or prefer to use?",
        "I can recommend food options based on your taste preferences. What cuisines do you typically enjoy?",
        "For the best food recommendations, could you tell me about any dietary restrictions or preferences you have?",
        "I can suggest meal ideas if you let me know what you're in the mood for or any dietary considerations.",
        "I'd be glad to help with food suggestions. What kind of meal are you looking for, and do you have any preferences?",
        "For tailored food recommendations, could you share some information about your tastes or dietary needs?",
        "I can recommend meal options based on your preferences. What kinds of foods do you typically enjoy?",
        "I'd be happy to suggest food ideas. Do you have any particular cuisine preferences or dietary requirements?"
      ]
    },
    {
      "tag": "travel",
      "patterns": [
        "Where should I travel",
        "Best vacation spots",
        "Travel recommendations",
        "Good places to visit",
        "Vacation ideas",
        "Best countries to visit",
        "Travel destinations",
        "Weekend getaway ideas",
        "Best cities to visit",
        "Tourist attractions"
      ],
      "responses": [
        "do visit jammu and kashmir it is very comfortable place..."
      ]
    },
    {
      "tag": "health",
      "patterns": [
        "Health tips",
        "How to stay healthy",
        "Exercise advice",
        "Healthy lifestyle tips",
        "Diet recommendations",
        "How to lose weight",
        "How to gain muscle",
        "Sleep improvement tips",
        "Mental health advice",
        "Wellness suggestions"
      ],
      "responses": [
        "General health practices include regular exercise, balanced nutrition, adequate sleep, stress management, and regular health check-ups.",
        "For overall wellness, consider focusing on nutritious foods, regular physical activity, quality sleep, stress reduction, and staying hydrated.",
        "Healthy lifestyle habits typically include balanced eating, regular movement, proper hydration, adequate sleep, and stress management techniques.",
        "General wellness tips include eating a variety of nutritious foods, staying active, getting sufficient sleep, managing stress, and staying socially connected.",
        "For general health, focus on a balanced diet, regular physical activity, proper sleep hygiene, stress management, and preventive healthcare.",
        "Healthy living generally involves nutritious eating, regular exercise, proper hydration"
      ]
    }
  ]
}